------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/ji252/Documents/GitHub/multnomah
> -county-tax/code/logs/00_log_multnomah_2026-01-13.lo
> g
  log type:  text
 opened on:  13 Jan 2026, 22:11:42

. 
. ** Set Seed 
. set seed 56403

. 
. ** Set scheme
. set scheme plotplainblind

. 
. ** Set parameters 
. local overwrite_csv = 0

. global start_year_acs = 2015

. global end_year_acs = 2024

. 
end of do-file

. do "C:\Users\ji252\AppData\Local\Temp\STD3414_000007
> .tmp"

. /***************************************************
> ****************************
> File Name:              02_sdid_analysis_parallel.do
> Creator:                John Iselin (parallelized ve
> rsion)
> Date Update:    January 13, 2025
> 
> Called by: 00_multnomah.do
> 
> Purpose: Perform synthetic difference-in-difference 
> estimation using parallel
>          processing to speed up computation across m
> ultiple specifications.
> 
>          Each parallel child runs all 6 specificatio
> ns for one table:
>          - 3 outcome variables (n1, n2, agi) for a g
> iven migration type
>          - Each with 2 covariate settings (with/with
> out controls)
>          This allows tables to be generated within e
> ach child process.
> 
> Requirements:
> - parallel package: net install parallel, from(https
> ://raw.github.com/gvegayon/parallel/stable/) replace
> 
> Outputs:
> - sdid_weights.dta/xlsx: Synthetic control weights f
> or each specification
> - sdid_results.dta/xlsx: Treatment effects, SEs, p-v
> alues for each specification
> - tab_sdid_*.tex: LaTeX tables for each specificatio
> n group
> - fig_speccurve_*.pdf/jpg: Specification curve plots
> 
> Authors: John Iselin
> 
> For more information, contact john.iselin@yale.edu
> 
> ****************************************************
> ***************************/
. 
. ** Start log file
. capture log close log_02

. log using "${logs}02_log_sdid_parallel_${date}", rep
> lace text name(log_02)
------------------------------------------------------
      name:  log_02
       log:  C:/Users/ji252/Documents/GitHub/multnomah
> -county-tax/code/logs/02_log_sdid_parallel_2026-01-1
> 3.log
  log type:  text
 opened on:  13 Jan 2026, 22:12:22

. 
. /***************************************************
> ****************************
> SECTION 1: SETUP AND CONFIGURATION
> ****************************************************
> ***************************/
. 
. ** Set number of parallel clusters (adjust based on 
> your machine)
. ** Use fewer than total cores to leave resources for
>  system
. local n_clusters = 6

. 
. ** Parameters
. local reps = 100

. 
. ** Initialize parallel processing
. parallel initialize `n_clusters', force
N Child processes: 6
Stata dir:  C:\Program Files\StataNow19/StataMP-64.exe

. 
. /***************************************************
> ****************************
> SECTION 2: DATA PREPARATION
> (Same as original - prepares main analysis dataset)
> ****************************************************
> ***************************/
. 
. ** Load data
. use "${data}working/irs_county_gross", replace

. 
. ** Keep required variables
. keep year fips state* county* *_net_3 *_out_1 *_out_
> 2 *_in_3 *_out_3

. order year fips state* county*

. 
. ** Merge with ACS Data
. merge 1:1 year fips using "${data}working/acs_county
> _gross_18plus", gen(merge_acs_1)
(variable fips was float, now double to accommodate
       using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        20,771
        from master                    18,963  (merge_
> acs_1==1)
        from using                      1,808  (merge_
> acs_1==2)

    Matched                             3,017  (merge_
> acs_1==3)
    -----------------------------------------

. 
. ** Keep require variables
. keep year fips state* county* *_net_3 *_out_1 *_out_
> 2 *_in_3 *_out_3 merge_acs_*

. 
. ** Label acs samples
. rename persons_* acs1_persons_*

. rename households_* acs1_households_*

. rename dollars_* acs1_dollars_*

. 
. ** Merge with ACS Data
. merge 1:1 year fips using "${data}working/acs_county
> _gross_college", gen(merge_acs_2)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        18,963
        from master                    18,963  (merge_
> acs_2==1)
        from using                          0  (merge_
> acs_2==2)

    Matched                             4,825  (merge_
> acs_2==3)
    -----------------------------------------

. 
. ** Keep require variables
. keep year fips state* county* *_net_3 *_out_1 *_out_
> 2 *_in_3 *_out_3  merge_acs_*

. 
. ** Label acs samples
. rename persons_* acs2_persons_*

. rename households_* acs2_households_*

. rename dollars_* acs2_dollars_*

. 
. ** Drop "other counties"
. drop if county_fips == 0
(483 observations deleted)

. drop if year == 2015
(430 observations deleted)

. 
. ** Merge with Demographic data
. merge m:1 fips using "${data}working/demographics_20
> 20",        ///
>         gen(demo_merge) keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            27
        from master                        27  (demo_m
> erge==1)
        from using                          0  (demo_m
> erge==2)

    Matched                            22,848  (demo_m
> erge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name demo_merge, m

                     |  Matching
                     |   result
                     | from merge
          State name | Master on |     Total
---------------------+-----------+----------
                     |        21 |        21 
             Alabama |         0 |       479 
              Alaska |         6 |       204 
             Arizona |         0 |       113 
            Arkansas |         0 |       531 
          California |         0 |       474 
            Colorado |         0 |       452 
         Connecticut |         0 |        48 
            Delaware |         0 |        27 
District of Columbia |         0 |         9 
             Florida |         0 |       535 
             Georgia |         0 |     1,157 
              Hawaii |         0 |        34 
               Idaho |         0 |       310 
            Illinois |         0 |       740 
             Indiana |         0 |       676 
                Iowa |         0 |       703 
              Kansas |         0 |       741 
            Kentucky |         0 |       854 
           Louisiana |         0 |       462 
               Maine |         0 |       116 
            Maryland |         0 |       190 
       Massachusetts |         0 |       116 
            Michigan |         0 |       613 
           Minnesota |         0 |       625 
         Mississippi |         0 |       580 
            Missouri |         0 |       819 
             Montana |         0 |       394 
            Nebraska |         0 |       657 
              Nevada |         0 |       123 
       New Hampshire |         0 |        70 
          New Jersey |         0 |       181 
          New Mexico |         0 |       235 
            New York |         0 |       476 
      North Carolina |         0 |       736 
        North Dakota |         0 |       373 
                Ohio |         0 |       658 
            Oklahoma |         0 |       547 
              Oregon |         0 |       268 
        Pennsylvania |         0 |       509 
        Rhode Island |         0 |        41 
      South Carolina |         0 |       338 
        South Dakota |         0 |       462 
           Tennessee |         0 |       687 
               Texas |         0 |     1,854 
                Utah |         0 |       213 
             Vermont |         0 |       100 
            Virginia |         0 |       951 
          Washington |         0 |       293 
       West Virginia |         0 |       387 
           Wisconsin |         0 |       530 
             Wyoming |         0 |       163 
---------------------+-----------+----------
               Total |        27 |    22,875 


                     |  Matching
                     |   result
                     | from merge
          State name | Matched ( |     Total
---------------------+-----------+----------
                     |         0 |        21 
             Alabama |       479 |       479 
              Alaska |       198 |       204 
             Arizona |       113 |       113 
            Arkansas |       531 |       531 
          California |       474 |       474 
            Colorado |       452 |       452 
         Connecticut |        48 |        48 
            Delaware |        27 |        27 
District of Columbia |         9 |         9 
             Florida |       535 |       535 
             Georgia |     1,157 |     1,157 
              Hawaii |        34 |        34 
               Idaho |       310 |       310 
            Illinois |       740 |       740 
             Indiana |       676 |       676 
                Iowa |       703 |       703 
              Kansas |       741 |       741 
            Kentucky |       854 |       854 
           Louisiana |       462 |       462 
               Maine |       116 |       116 
            Maryland |       190 |       190 
       Massachusetts |       116 |       116 
            Michigan |       613 |       613 
           Minnesota |       625 |       625 
         Mississippi |       580 |       580 
            Missouri |       819 |       819 
             Montana |       394 |       394 
            Nebraska |       657 |       657 
              Nevada |       123 |       123 
       New Hampshire |        70 |        70 
          New Jersey |       181 |       181 
          New Mexico |       235 |       235 
            New York |       476 |       476 
      North Carolina |       736 |       736 
        North Dakota |       373 |       373 
                Ohio |       658 |       658 
            Oklahoma |       547 |       547 
              Oregon |       268 |       268 
        Pennsylvania |       509 |       509 
        Rhode Island |        41 |        41 
      South Carolina |       338 |       338 
        South Dakota |       462 |       462 
           Tennessee |       687 |       687 
               Texas |     1,854 |     1,854 
                Utah |       213 |       213 
             Vermont |       100 |       100 
            Virginia |       951 |       951 
          Washington |       293 |       293 
       West Virginia |       387 |       387 
           Wisconsin |       530 |       530 
             Wyoming |       163 |       163 
---------------------+-----------+----------
               Total |    22,848 |    22,875 

. tab year demo_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |         0      3,140 |     3,140 
      2017 |         0      3,140 |     3,140 
      2018 |         0      3,140 |     3,140 
      2019 |         0      3,140 |     3,140 
      2020 |         2      3,140 |     3,142 
      2021 |         2      3,141 |     3,143 
      2022 |         9      3,133 |     3,142 
      2023 |         7        437 |       444 
      2024 |         7        437 |       444 
-----------+----------------------+----------
     Total |        27     22,848 |    22,875 

. 
. ** Keep if matched
. keep if demo_merge == 3
(27 observations deleted)

. drop demo_merge

. 
. ** Rename
. rename population pop_census

. 
. ** Merge with Demographic data
. merge m:1 year fips using "${data}working/bea_econom
> ics",       ///
>         gen(econ_merge) keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           366
        from master                       366  (econ_m
> erge==1)
        from using                          0  (econ_m
> erge==2)

    Matched                            22,482  (econ_m
> erge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name econ_merge, m

                     |  Matching
                     |   result
                     | from merge
          State name | Master on |     Total
---------------------+-----------+----------
             Alabama |         0 |       479 
              Alaska |         0 |       198 
             Arizona |         0 |       113 
            Arkansas |         0 |       531 
          California |         0 |       474 
            Colorado |         0 |       452 
         Connecticut |         0 |        48 
            Delaware |         0 |        27 
District of Columbia |         0 |         9 
             Florida |         0 |       535 
             Georgia |         0 |     1,157 
              Hawaii |         9 |        34 
               Idaho |         0 |       310 
            Illinois |         0 |       740 
             Indiana |         0 |       676 
                Iowa |         0 |       703 
              Kansas |         0 |       741 
            Kentucky |         0 |       854 
           Louisiana |         0 |       462 
               Maine |         0 |       116 
            Maryland |         0 |       190 
       Massachusetts |         0 |       116 
            Michigan |         0 |       613 
           Minnesota |         0 |       625 
         Mississippi |         0 |       580 
            Missouri |         0 |       819 
             Montana |         0 |       394 
            Nebraska |         0 |       657 
              Nevada |         0 |       123 
       New Hampshire |         0 |        70 
          New Jersey |         0 |       181 
          New Mexico |         0 |       235 
            New York |         0 |       476 
      North Carolina |         0 |       736 
        North Dakota |         0 |       373 
                Ohio |         0 |       658 
            Oklahoma |         0 |       547 
              Oregon |         0 |       268 
        Pennsylvania |         0 |       509 
        Rhode Island |         0 |        41 
      South Carolina |         0 |       338 
        South Dakota |         0 |       462 
           Tennessee |         0 |       687 
               Texas |         0 |     1,854 
                Utah |         0 |       213 
             Vermont |         0 |       100 
            Virginia |       357 |       951 
          Washington |         0 |       293 
       West Virginia |         0 |       387 
           Wisconsin |         0 |       530 
             Wyoming |         0 |       163 
---------------------+-----------+----------
               Total |       366 |    22,848 


                     |  Matching
                     |   result
                     | from merge
          State name | Matched ( |     Total
---------------------+-----------+----------
             Alabama |       479 |       479 
              Alaska |       198 |       198 
             Arizona |       113 |       113 
            Arkansas |       531 |       531 
          California |       474 |       474 
            Colorado |       452 |       452 
         Connecticut |        48 |        48 
            Delaware |        27 |        27 
District of Columbia |         9 |         9 
             Florida |       535 |       535 
             Georgia |     1,157 |     1,157 
              Hawaii |        25 |        34 
               Idaho |       310 |       310 
            Illinois |       740 |       740 
             Indiana |       676 |       676 
                Iowa |       703 |       703 
              Kansas |       741 |       741 
            Kentucky |       854 |       854 
           Louisiana |       462 |       462 
               Maine |       116 |       116 
            Maryland |       190 |       190 
       Massachusetts |       116 |       116 
            Michigan |       613 |       613 
           Minnesota |       625 |       625 
         Mississippi |       580 |       580 
            Missouri |       819 |       819 
             Montana |       394 |       394 
            Nebraska |       657 |       657 
              Nevada |       123 |       123 
       New Hampshire |        70 |        70 
          New Jersey |       181 |       181 
          New Mexico |       235 |       235 
            New York |       476 |       476 
      North Carolina |       736 |       736 
        North Dakota |       373 |       373 
                Ohio |       658 |       658 
            Oklahoma |       547 |       547 
              Oregon |       268 |       268 
        Pennsylvania |       509 |       509 
        Rhode Island |        41 |        41 
      South Carolina |       338 |       338 
        South Dakota |       462 |       462 
           Tennessee |       687 |       687 
               Texas |     1,854 |     1,854 
                Utah |       213 |       213 
             Vermont |       100 |       100 
            Virginia |       594 |       951 
          Washington |       293 |       293 
       West Virginia |       387 |       387 
           Wisconsin |       530 |       530 
             Wyoming |       163 |       163 
---------------------+-----------+----------
               Total |    22,482 |    22,848 

. tab year econ_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |        52      3,088 |     3,140 
      2017 |        52      3,088 |     3,140 
      2018 |        52      3,088 |     3,140 
      2019 |        52      3,088 |     3,140 
      2020 |        52      3,088 |     3,140 
      2021 |        53      3,088 |     3,141 
      2022 |        53      3,080 |     3,133 
      2023 |         0        437 |       437 
      2024 |         0        437 |       437 
-----------+----------------------+----------
     Total |       366     22,482 |    22,848 

. 
. ** Keep if matched
. keep if econ_merge == 3
(366 observations deleted)

. drop econ_merge

. 
. ** Merge with COVID-19 Data
. merge m:1 fips using ${data}working/covid_cleaned_wi
> de.dta,     ///
>         gen(covid_merge) keep(master match )
(variable state_name was str20, now str24 to
       accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            73
        from master                        73  (covid_
> merge==1)
        from using                          0  (covid_
> merge==2)

    Matched                            22,409  (covid_
> merge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name covid_merge, m

                      |  Matching
                      |   result
                      | from merge
           State name | Master on |     Total
----------------------+-----------+----------
              Alabama |         0 |       479 
               Alaska |        28 |       198 
              Arizona |         0 |       113 
             Arkansas |         0 |       531 
           California |         0 |       474 
             Colorado |         0 |       452 
          Connecticut |         0 |        48 
             Delaware |         0 |        27 
 District of Columbia |         0 |         9 
              Florida |         0 |       535 
              Georgia |         0 |     1,157 
               Hawaii |         0 |        25 
                Idaho |         0 |       310 
             Illinois |         0 |       740 
              Indiana |         0 |       676 
                 Iowa |         0 |       703 
               Kansas |         0 |       741 
             Kentucky |         0 |       854 
            Louisiana |         0 |       462 
                Maine |         0 |       116 
             Maryland |         0 |       190 
        Massachusetts |         0 |       116 
             Michigan |         0 |       613 
            Minnesota |         0 |       625 
          Mississippi |         0 |       580 
             Missouri |         0 |       819 
              Montana |         0 |       394 
             Nebraska |         0 |       657 
               Nevada |         0 |       123 
        New Hampshire |         0 |        70 
           New Jersey |         0 |       181 
           New Mexico |         0 |       235 
             New York |        45 |       476 
       North Carolina |         0 |       736 
         North Dakota |         0 |       373 
                 Ohio |         0 |       658 
             Oklahoma |         0 |       547 
               Oregon |         0 |       268 
         Pennsylvania |         0 |       509 
         Rhode Island |         0 |        41 
       South Carolina |         0 |       338 
         South Dakota |         0 |       462 
            Tennessee |         0 |       687 
                Texas |         0 |     1,854 
                 Utah |         0 |       213 
              Vermont |         0 |       100 
             Virginia |         0 |       594 
           Washington |         0 |       293 
        West Virginia |         0 |       387 
            Wisconsin |         0 |       530 
              Wyoming |         0 |       163 
----------------------+-----------+----------
                Total |        73 |    22,482 


                      |  Matching
                      |   result
                      | from merge
           State name | Matched ( |     Total
----------------------+-----------+----------
              Alabama |       479 |       479 
               Alaska |       170 |       198 
              Arizona |       113 |       113 
             Arkansas |       531 |       531 
           California |       474 |       474 
             Colorado |       452 |       452 
          Connecticut |        48 |        48 
             Delaware |        27 |        27 
 District of Columbia |         9 |         9 
              Florida |       535 |       535 
              Georgia |     1,157 |     1,157 
               Hawaii |        25 |        25 
                Idaho |       310 |       310 
             Illinois |       740 |       740 
              Indiana |       676 |       676 
                 Iowa |       703 |       703 
               Kansas |       741 |       741 
             Kentucky |       854 |       854 
            Louisiana |       462 |       462 
                Maine |       116 |       116 
             Maryland |       190 |       190 
        Massachusetts |       116 |       116 
             Michigan |       613 |       613 
            Minnesota |       625 |       625 
          Mississippi |       580 |       580 
             Missouri |       819 |       819 
              Montana |       394 |       394 
             Nebraska |       657 |       657 
               Nevada |       123 |       123 
        New Hampshire |        70 |        70 
           New Jersey |       181 |       181 
           New Mexico |       235 |       235 
             New York |       431 |       476 
       North Carolina |       736 |       736 
         North Dakota |       373 |       373 
                 Ohio |       658 |       658 
             Oklahoma |       547 |       547 
               Oregon |       268 |       268 
         Pennsylvania |       509 |       509 
         Rhode Island |        41 |        41 
       South Carolina |       338 |       338 
         South Dakota |       462 |       462 
            Tennessee |       687 |       687 
                Texas |     1,854 |     1,854 
                 Utah |       213 |       213 
              Vermont |       100 |       100 
             Virginia |       594 |       594 
           Washington |       293 |       293 
        West Virginia |       387 |       387 
            Wisconsin |       530 |       530 
              Wyoming |       163 |       163 
----------------------+-----------+----------
                Total |    22,409 |    22,482 

. tab year covid_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |         9      3,079 |     3,088 
      2017 |         9      3,079 |     3,088 
      2018 |         9      3,079 |     3,088 
      2019 |         9      3,079 |     3,088 
      2020 |         9      3,079 |     3,088 
      2021 |         9      3,079 |     3,088 
      2022 |         9      3,071 |     3,080 
      2023 |         5        432 |       437 
      2024 |         5        432 |       437 
-----------+----------------------+----------
     Total |        73     22,409 |    22,482 

. 
. ** Organize data
. order year fips state_* county_*

. sort fips year

. isid fips year

. 
. ** Keep only sample with non-missing base population
> s
. tab county_name year if (missing(n1_out_1 ) | n1_out
> _1 == 0 ) & year <= 2022

                      |  Tax year
                      |   (year
                      |   before
                      |   move)
          County name |      2017 |     Total
----------------------+-----------+----------
        Loving County |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 

. drop if (missing(n1_out_1 ) | n1_out_1 == 0 ) & year
>  <= 2022
(1 observation deleted)

. 
. ** Keep only sample with observations in each year
. bysort fips: gen ct = _N

. tab county_name state_name if ct < 7

                      | State name
          County name | Connect.. |     Total
----------------------+-----------+----------
     Fairfield County |         6 |         6 
      Hartford County |         6 |         6 
    Litchfield County |         6 |         6 
        Loving County |         0 |         6 
     Middlesex County |         6 |         6 
     New Haven County |         6 |         6 
    New London County |         6 |         6 
       Tolland County |         6 |         6 
       Windham County |         6 |         6 
----------------------+-----------+----------
                Total |        48 |        54 


                      | State name
          County name |     Texas |     Total
----------------------+-----------+----------
     Fairfield County |         0 |         6 
      Hartford County |         0 |         6 
    Litchfield County |         0 |         6 
        Loving County |         6 |         6 
     Middlesex County |         0 |         6 
     New Haven County |         0 |         6 
    New London County |         0 |         6 
       Tolland County |         0 |         6 
       Windham County |         0 |         6 
----------------------+-----------+----------
                Total |         6 |        54 

. drop if ct < 7
(54 observations deleted)

. drop ct

. 
. ** Generate IRS sample
. gen irs_sample_1 = inrange(year, 2016, 2022)

. gen irs_sample_2 = inrange(year, 2016, 2022) & merge
> _acs_1 != 1

. 
. ** Generate ACS Period Indicators
. gen acs_period_1 = merge_acs_1 != 1 & inrange(year, 
> 2016, 2022)

. gen acs_period_2 = merge_acs_1 != 1

. 
. ** Make sure we have a balanced panel of ACS countie
> s
. gen tmp = merge_acs_1 != 1

. bysort fips: egen ct_tmp = total(tmp)

. replace acs_period_1 = 0 if ct_tmp != 9
(246 real changes made)

. replace acs_period_2 = 0 if ct_tmp != 9
(342 real changes made)

. replace irs_sample_2 = 0 if ct_tmp != 9
(246 real changes made)

. drop tmp ct_tmp

. 
. tab year irs_sample_1

  Tax year |
     (year |
    before |     irs_sample_1
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |         0      3,079 |     3,079 
      2017 |         0      3,079 |     3,079 
      2018 |         0      3,079 |     3,079 
      2019 |         0      3,079 |     3,079 
      2020 |         0      3,079 |     3,079 
      2021 |         0      3,079 |     3,079 
      2022 |         0      3,079 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |       874     21,553 |    22,427 

. tab year irs_sample_2

  Tax year |
     (year |
    before |     irs_sample_2
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |    19,704      2,723 |    22,427 

. tab year acs_period_1

  Tax year |
     (year |
    before |     acs_period_1
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |    19,704      2,723 |    22,427 

. tab year acs_period_2

  Tax year |
     (year |
    before |     acs_period_2
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |        48        389 |       437 
      2024 |        48        389 |       437 
-----------+----------------------+----------
     Total |    18,926      3,501 |    22,427 

. tab state_name acs_period_1

                      | acs_period
                      |     _1
           State name |         0 |     Total
----------------------+-----------+----------
              Alabama |       458 |       479 
               Alaska |       191 |       198 
              Arizona |        92 |       113 
             Arkansas |       510 |       531 
           California |       236 |       474 
             Colorado |       445 |       452 
             Delaware |         6 |        27 
 District of Columbia |         2 |         9 
              Florida |       339 |       535 
              Georgia |     1,017 |     1,157 
               Hawaii |        11 |        25 
                Idaho |       303 |       310 
             Illinois |       656 |       740 
              Indiana |       564 |       676 
                 Iowa |       675 |       703 
               Kansas |       720 |       741 
             Kentucky |       819 |       854 
            Louisiana |       413 |       462 
                Maine |       102 |       116 
             Maryland |       113 |       190 
        Massachusetts |       102 |       116 
             Michigan |       501 |       613 
            Minnesota |       583 |       625 
          Mississippi |       559 |       580 
             Missouri |       784 |       819 
              Montana |       394 |       394 
             Nebraska |       636 |       657 
               Nevada |       109 |       123 
        New Hampshire |        70 |        70 
           New Jersey |        62 |       181 
           New Mexico |       221 |       235 
             New York |       336 |       476 
       North Carolina |       610 |       736 
         North Dakota |       366 |       373 
                 Ohio |       525 |       658 
             Oklahoma |       526 |       547 
               Oregon |       219 |       268 
         Pennsylvania |       369 |       509 
         Rhode Island |        20 |        41 
       South Carolina |       331 |       338 
         South Dakota |       462 |       462 
            Tennessee |       638 |       687 
                Texas |     1,581 |     1,847 
                 Utah |       178 |       213 
              Vermont |       100 |       100 
             Virginia |       531 |       594 
           Washington |       230 |       293 
        West Virginia |       387 |       387 
            Wisconsin |       439 |       530 
              Wyoming |       163 |       163 
----------------------+-----------+----------
                Total |    19,704 |    22,427 


                      | acs_period
                      |     _1
           State name |         1 |     Total
----------------------+-----------+----------
              Alabama |        21 |       479 
               Alaska |         7 |       198 
              Arizona |        21 |       113 
             Arkansas |        21 |       531 
           California |       238 |       474 
             Colorado |         7 |       452 
             Delaware |        21 |        27 
 District of Columbia |         7 |         9 
              Florida |       196 |       535 
              Georgia |       140 |     1,157 
               Hawaii |        14 |        25 
                Idaho |         7 |       310 
             Illinois |        84 |       740 
              Indiana |       112 |       676 
                 Iowa |        28 |       703 
               Kansas |        21 |       741 
             Kentucky |        35 |       854 
            Louisiana |        49 |       462 
                Maine |        14 |       116 
             Maryland |        77 |       190 
        Massachusetts |        14 |       116 
             Michigan |       112 |       613 
            Minnesota |        42 |       625 
          Mississippi |        21 |       580 
             Missouri |        35 |       819 
              Montana |         0 |       394 
             Nebraska |        21 |       657 
               Nevada |        14 |       123 
        New Hampshire |         0 |        70 
           New Jersey |       119 |       181 
           New Mexico |        14 |       235 
             New York |       140 |       476 
       North Carolina |       126 |       736 
         North Dakota |         7 |       373 
                 Ohio |       133 |       658 
             Oklahoma |        21 |       547 
               Oregon |        49 |       268 
         Pennsylvania |       140 |       509 
         Rhode Island |        21 |        41 
       South Carolina |         7 |       338 
         South Dakota |         0 |       462 
            Tennessee |        49 |       687 
                Texas |       266 |     1,847 
                 Utah |        35 |       213 
              Vermont |         0 |       100 
             Virginia |        63 |       594 
           Washington |        63 |       293 
        West Virginia |         0 |       387 
            Wisconsin |        91 |       530 
              Wyoming |         0 |       163 
----------------------+-----------+----------
                Total |     2,723 |    22,427 

. 
. ** Define treated state
. gen multnomah = state_fips == 41 & county_fips == 51

. label var multnomah "Indicator for Multnomah County,
>  Oregon"

. 
. ** Define treatment indicator
. gen Treated = multnomah == 1 & year > 2020

. label var Treated "Treatment indicator for Multnomah
>  County, Oregon"

. 
. ** Define sample 1: All counties
. gen sample_all = 1

. label var sample_all "All counties (excluding AK, CA
> , HI OR, WA)"

. 
. ** Define sample 2: Counties in top 95 percent
. summ percent_urban if year == 2020, de

            Percent of population in urban areas
------------------------------------------------------
> -------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             
>   3,079
25%            0              0       Sum of wgt.     
>   3,079

50%     .3256337                      Mean           .
> 3521437
                        Largest       Std. dev.       
> .332065
75%     .6326353              1
90%      .847923              1       Variance       .
> 1102672
95%     .9372299              1       Skewness       .
> 3661052
99%     .9972304              1       Kurtosis       1
> .763629

. local cutoff = r(p95)

. tab state_name multnomah if percent_urban >= `cutoff
> ' & year == 2020

                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         0 |     Total
----------------------+-----------+----------
               Alaska |         1 |         1 
              Arizona |         1 |         1 
           California |        15 |        15 
             Colorado |         4 |         4 
             Delaware |         1 |         1 
 District of Columbia |         1 |         1 
              Florida |        13 |        13 
              Georgia |         8 |         8 
               Hawaii |         1 |         1 
                Idaho |         1 |         1 
             Illinois |         5 |         5 
              Indiana |         3 |         3 
                 Iowa |         1 |         1 
               Kansas |         2 |         2 
             Kentucky |         2 |         2 
            Louisiana |         3 |         3 
             Maryland |         3 |         3 
        Massachusetts |         5 |         5 
             Michigan |         3 |         3 
            Minnesota |         3 |         3 
             Missouri |         4 |         4 
             Nebraska |         2 |         2 
               Nevada |         3 |         3 
           New Jersey |        10 |        10 
           New Mexico |         2 |         2 
             New York |         9 |         9 
       North Carolina |         4 |         4 
                 Ohio |         6 |         6 
             Oklahoma |         1 |         1 
               Oregon |         1 |         2 
         Pennsylvania |         4 |         4 
         Rhode Island |         2 |         2 
            Tennessee |         2 |         2 
                Texas |        11 |        11 
                 Utah |         4 |         4 
             Virginia |        10 |        10 
           Washington |         1 |         1 
            Wisconsin |         1 |         1 
----------------------+-----------+----------
                Total |       153 |       154 


                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         1 |     Total
----------------------+-----------+----------
               Alaska |         0 |         1 
              Arizona |         0 |         1 
           California |         0 |        15 
             Colorado |         0 |         4 
             Delaware |         0 |         1 
 District of Columbia |         0 |         1 
              Florida |         0 |        13 
              Georgia |         0 |         8 
               Hawaii |         0 |         1 
                Idaho |         0 |         1 
             Illinois |         0 |         5 
              Indiana |         0 |         3 
                 Iowa |         0 |         1 
               Kansas |         0 |         2 
             Kentucky |         0 |         2 
            Louisiana |         0 |         3 
             Maryland |         0 |         3 
        Massachusetts |         0 |         5 
             Michigan |         0 |         3 
            Minnesota |         0 |         3 
             Missouri |         0 |         4 
             Nebraska |         0 |         2 
               Nevada |         0 |         3 
           New Jersey |         0 |        10 
           New Mexico |         0 |         2 
             New York |         0 |         9 
       North Carolina |         0 |         4 
                 Ohio |         0 |         6 
             Oklahoma |         0 |         1 
               Oregon |         1 |         2 
         Pennsylvania |         0 |         4 
         Rhode Island |         0 |         2 
            Tennessee |         0 |         2 
                Texas |         0 |        11 
                 Utah |         0 |         4 
             Virginia |         0 |        10 
           Washington |         0 |         1 
            Wisconsin |         0 |         1 
----------------------+-----------+----------
                Total |         1 |       154 

. gen sample_urban95 = percent_urban >= `cutoff' // Al
> l counties

. label var sample_urban95 "Urban counties (top 5%) (e
> xcluding AK, CA, HI OR, WA)"

. tab sample_urban95 if year == 2020

      Urban |
   counties |
   (top 5%) |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,925       95.00       95.00
          1 |        154        5.00      100.00
------------+-----------------------------------
      Total |      3,079      100.00

. 
. ** Define sample 3: Counties in top 98 percent
. local cutoff = .9864539 //

. tab state_name multnomah if percent_urban >= `cutoff
> ' & year == 2020

                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         0 |     Total
----------------------+-----------+----------
           California |         6 |         6 
             Colorado |         2 |         2 
 District of Columbia |         1 |         1 
              Florida |         4 |         4 
              Georgia |         5 |         5 
             Illinois |         2 |         2 
              Indiana |         1 |         1 
            Louisiana |         1 |         1 
             Maryland |         1 |         1 
        Massachusetts |         1 |         1 
             Michigan |         1 |         1 
            Minnesota |         1 |         1 
             Missouri |         1 |         1 
               Nevada |         1 |         1 
           New Jersey |         6 |         6 
             New York |         7 |         7 
       North Carolina |         1 |         1 
                 Ohio |         1 |         1 
               Oregon |         0 |         1 
         Pennsylvania |         2 |         2 
         Rhode Island |         1 |         1 
                Texas |         3 |         3 
                 Utah |         2 |         2 
             Virginia |         8 |         8 
            Wisconsin |         1 |         1 
----------------------+-----------+----------
                Total |        60 |        61 


                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         1 |     Total
----------------------+-----------+----------
           California |         0 |         6 
             Colorado |         0 |         2 
 District of Columbia |         0 |         1 
              Florida |         0 |         4 
              Georgia |         0 |         5 
             Illinois |         0 |         2 
              Indiana |         0 |         1 
            Louisiana |         0 |         1 
             Maryland |         0 |         1 
        Massachusetts |         0 |         1 
             Michigan |         0 |         1 
            Minnesota |         0 |         1 
             Missouri |         0 |         1 
               Nevada |         0 |         1 
           New Jersey |         0 |         6 
             New York |         0 |         7 
       North Carolina |         0 |         1 
                 Ohio |         0 |         1 
               Oregon |         1 |         1 
         Pennsylvania |         0 |         2 
         Rhode Island |         0 |         1 
                Texas |         0 |         3 
                 Utah |         0 |         2 
             Virginia |         0 |         8 
            Wisconsin |         0 |         1 
----------------------+-----------+----------
                Total |         1 |        61 

. gen sample_urban98 = percent_urban >= `cutoff' // Al
> l counties

. label var sample_urban98 "Urban counties (top 1%) (e
> xcluding AK, CA, HI OR, WA)"

. tab sample_urban98 if year == 2020

      Urban |
   counties |
   (top 1%) |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,018       98.02       98.02
          1 |         61        1.98      100.00
------------+-----------------------------------
      Total |      3,079      100.00

. 
. ** Define Sample of States
. drop if state_name == "Alaska"
(198 observations deleted)

. drop if state_name == "Hawaii"
(25 observations deleted)

. drop if state_name == "California"
(474 observations deleted)

. drop if state_name == "Washington"
(293 observations deleted)

. drop if state_name == "Oregon" & multnomah == 0
(259 observations deleted)

. 
. ** Define sample 4: Counties in top 95 + covid
. cluster kmeans cases_cum* deaths_cum* if        ///
>         sample_urban95 == 1 & year == 2020 & covid_m
> erge == 3 , k(5) gen(kmean)
cluster name: _clus_1

. bysort fips: egen kmean_group = mean(kmean)
(20,046 missing values generated)

. 
. ** Pull out kmeans cluster with Multnoma
. gen tmp1 = kmean if sample_urban95 == 1 & year == 20
> 20 & covid_merge == 3 & multnomah == 1
(21,177 missing values generated)

. egen tmp2 = mean(tmp1)

. gen sample_urban95_covid = sample_urban95 == 1 & kme
> an_group == tmp2

. drop tmp1 tmp2

. label var sample_urban95_covid "Urban counties (top 
> 5%) w. Kmean Covid Match  (excluding AK, CA, HI OR, 
> WA)"

. tab sample_urban95_covid if year == 2020

      Urban |
   counties |
(top 5%) w. |
Kmean Covid |
      Match |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,879       98.73       98.73
          1 |         37        1.27      100.00
------------+-----------------------------------
      Total |      2,916      100.00

. 
. ** Show results across clusters
. preserve

. 
. ** Keep required variables
. keep if sample_urban95 == 1 & year == 2020 & covid_m
> erge == 3
(21,048 observations deleted)

. keep kmean cases_cum* deaths_cum* population

. collapse (mean) cases_cum* deaths_cum* [fw = populat
> ion], by(kmean)

. reshape long cases_cum deaths_cum, i(kmean) j(time)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 2
> 0 21 22 23 24 25 26 27 28 29)

Data                               Wide   ->   Long
------------------------------------------------------
> -----------------------
Number of observations                5   ->   145    
>      
Number of variables                  59   ->   4      
>      
j variable (29 values)                    ->   time
xij variables:
  cases_cum1 cases_cum2 ... cases_cum29   ->   cases_c
> um
deaths_cum1 deaths_cum2 ... deaths_cum29  ->   deaths_
> cum
------------------------------------------------------
> -----------------------

. xtset kmean time

Panel variable: kmean (strongly balanced)
 Time variable: time, 1 to 29
         Delta: 1 unit

. xtline cases_cum

. graph export "${results}sdid/fig_kmeans.jpg", as(jpg
> ) name("Graph") quality(100) replace
file C:/Users/ji252/Documents/GitHub/multnomah-county-
> tax/results/sdid/fig_kmeans.jpg written in JPEG form
> at

. clear

. 
. ** Restore
. restore

. 
. ** Define covariates
. local covariates "population per_capita_income"

. 
. ** Standardize covariates
. foreach v of local covariates {
  2.         egen tmp_v = std(`v')
  3.         replace `v' = tmp_v
  4.         drop tmp_v
  5. } // END COVAR LOOP
(21,178 real changes made)
(21,178 real changes made)

. 
. ** Define outcome variables (IRS)
. foreach x in "n1" "n2" "agi" {
  2. 
.         if "`x'" == "n1" local xtxt "returns"
  3.         else if "`x'" == "n2" local xtxt "exempti
> ons"
  4.         else if "`x'" == "agi" local xtxt "AGI"
  5. 
.         ** Loop over migration type
.         foreach y in "net" "in" "out" {
  6. 
.                         if "`y'" == "net" local ytxt
>  "Net domestic migration"
  7.                         else if "`y'" == "in" loc
> al ytxt "Domestic in-migration"
  8.                         else if "`y'" == "out" lo
> cal ytxt "Domestic out-migration"
  9. 
.                         ** Generate
.                         gen `x'_`y'_rate_irs = 100 *
>  (`x'_`y'_3 / (`x'_out_1 + `x'_out_2))
 10. 
.                         ** Label var
.                         label var `x'_`y'_rate_irs  
>     "`ytxt' rate, `xtxt' (%)"
 11. 
.         } // END MIGRATION TYPE LOOP
 12. 
. } // END OUTCOME TYPE LOOP
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)

. 
. ** Define outcome variables (ACS)
. 
. ** Rename for loop
. rename acs*_households_* acs*_n1_*

. rename acs*_persons_* acs*_n2_*

. rename acs*_dollars_* acs*_agi_*

. 
. ** Loop over sample
. ** (18+ = 1, college degree == 2, no college degree 
> == 3)
. forvalues i = 1/2{
  2. 
.         if `i' == 1 local itxt ""
  3.         else if `i' == 2 local itxt " (College)"
  4.         else if `i' == 3 local itxt " (No College
> )"
  5. 
. 
.         ** Define outcome variables (IRS)
.         foreach x in "n1" "n2" "agi" {
  6. 
.                 if "`x'" == "n1" local xtxt "HHs"
  7.                 else if "`x'" == "n2" local xtxt 
> "persons"
  8.                 else if "`x'" == "agi" local xtxt
>  "total income"
  9. 
. 
.                 ** Loop over migration type
.                 foreach y in "net" "in" "out" {
 10. 
.                                 if "`y'" == "net" lo
> cal ytxt "Net domestic migration"
 11.                                 else if "`y'" == 
> "in" local ytxt "Domestic in-migration"
 12.                                 else if "`y'" == 
> "out" local ytxt "Domestic out-migration"
 13. 
.                                 ** Generate
.                                 gen `x'_`y'_rate_acs
> `i' = 100 * (acs`i'_`x'_`y'_3 / (acs`i'_`x'_out_1 + 
> acs`i'_`x'_out_2))
 14. 
.                                 ** Label var
.                                 label var `x'_`y'_ra
> te_acs`i' "`ytxt' rate, `xtxt'`itxt' (%)"
 15. 
.                 } // END MIGRATION TYPE LOOP
 16. 
.         } // END OUTCOME TYPE LOOP
 17. 
. } // END SAMPLE LOOP
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)

. 
. ** Declare panel
. xtset fips year

Panel variable: fips (unbalanced)
 Time variable: year, 2016 to 2024
         Delta: 1 unit

. 
. ** Tag unique fips
. egen unique = tag(fips)

. tab year unique

  Tax year |
     (year |
    before |       tag(fips)
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |         0      2,916 |     2,916 
      2017 |     2,916          0 |     2,916 
      2018 |     2,916          0 |     2,916 
      2019 |     2,916          0 |     2,916 
      2020 |     2,916          0 |     2,916 
      2021 |     2,916          0 |     2,916 
      2022 |     2,916          0 |     2,916 
      2023 |       383          0 |       383 
      2024 |       383          0 |       383 
-----------+----------------------+----------
     Total |    18,262      2,916 |    21,178 

. 
. ** Label var
. label var year "Year (destination)"

. 
. /***************************************************
> ****************************
> SECTION 3: CREATE TABLE-LEVEL SPECIFICATION GRID
> Each row represents one table = 6 SDID specs (3 outc
> omes  2 covariate settings)
> ****************************************************
> ***************************/
. 
. ** Save main analysis data
. save "${data}working/sdid_analysis_data.dta", replac
> e
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/sdid_analysis_data.dta saved

. 
. ** Create table-level specification grid
. preserve

. clear

. 
. ** Table units are defined by:
. ** - data_var (irs_sample_1, irs_sample_2, acs_perio
> d_1, acs_period_2)
. ** - out_type (irs, acs1, acs2) - but tied to data_v
> ar
. ** - samp_var (sample_all, sample_urban95, sample_ur
> ban95_covid)
. ** - exclusion (0, 1)
. ** - migr_type (net, in, out)
. ** Total: 6 data-type combos  3 samples  2 exclusi
> ons  3 migrations = 108 tables
. 
. local table_id = 0

. 
. ** Initialize empty dataset
. set obs 0
Number of observations (_N) was 0, now 0.

. gen table_id = .

. gen data_var = ""

. gen out_type = ""

. gen out_txt = ""

. gen samp_var = ""

. gen exclusion = .

. gen migr_type = ""

. 
. save "${data}working/table_grid.dta", replace
(dataset contains 0 observations)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved

. 
. ** Build table grid
. foreach data in "irs_sample_1" "irs_sample_2" "acs_p
> eriod_1" "acs_period_2" {
  2. 
.         ** Different sets of outcome variable types
.         if "`data'" == "irs_sample_1" | "`data'" == 
> "irs_sample_2" {
  3.                 local out_types "irs"
  4.         }
  5.         else {
  6.                 local out_types "acs1 acs2"
  7.         }
  8. 
.         foreach type of local out_types {
  9. 
.                 ** Labels
.                 if "`data'" == "irs_sample_1" local 
> out_txt "irs_full_16_22"
 10.                 else if "`data'" == "irs_sample_2
> " local out_txt "irs_389_16_22"
 11.                 else if "`data'" == "acs_period_1
> " & "`type'" == "acs1" local out_txt "acs_16_22_all"
 12.                 else if "`data'" == "acs_period_1
> " & "`type'" == "acs2" local out_txt "acs_16_22_col"
 13.                 else if "`data'" == "acs_period_2
> " & "`type'" == "acs1" local out_txt "acs_16_24_all"
 14.                 else if "`data'" == "acs_period_2
> " & "`type'" == "acs2" local out_txt "acs_16_24_col"
 15. 
.                 foreach samp in "sample_all" "sample
> _urban95" "sample_urban95_covid" {
 16.                         forvalues exl = 0/1 {
 17.                                 foreach migr in "
> net" "in" "out" {
 18. 
.                                         local table_
> id = `table_id' + 1
 19. 
.                                         ** Add row t
> o grid
.                                         clear
 20.                                         set obs 1
 21.                                         gen table
> _id = `table_id'
 22.                                         gen data_
> var = "`data'"
 23.                                         gen out_t
> ype = "`type'"
 24.                                         gen out_t
> xt = "`out_txt'"
 25.                                         gen samp_
> var = "`samp'"
 26.                                         gen exclu
> sion = `exl'
 27.                                         gen migr_
> type = "`migr'"
 28. 
.                                         append using
>  "${data}working/table_grid.dta"
 29.                                         save "${d
> ata}working/table_grid.dta", replace
 30. 
.                                 }
 31.                         }
 32.                 }
 33.         }
 34. }
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved

. 
. ** Load and verify grid
. use "${data}working/table_grid.dta", clear

. dis "Total table units: " _N
Total table units: 108

. sort table_id

. save "${data}working/table_grid.dta", replace
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved

. 
. restore

. 
. /***************************************************
> ****************************
> SECTION 4: DEFINE PARALLEL PROGRAM FOR TABLE-LEVEL S
> DID ESTIMATION
> Each call runs 6 SDID specs and generates one table
> ****************************************************
> ***************************/
. 
. ** Define program to run all SDID specifications for
>  one table
. capture program drop run_sdid_table

. program define run_sdid_table
  1.         syntax, table_id(integer) data_path(strin
> g) results_path(string) reps(integer)
  2. 
.         ** Load table specification from grid
.         preserve
  3.         use "`data_path'working/table_grid.dta", 
> clear
  4.         keep if table_id == `table_id'
  5. 
.         ** Extract specification parameters
.         local data_var = data_var[1]
  6.         local out_type = out_type[1]
  7.         local out_txt = out_txt[1]
  8.         local samp_var = samp_var[1]
  9.         local exl = exclusion[1]
 10.         local migr = migr_type[1]
 11. 
.         restore
 12. 
.         ** Load main analysis data
.         use "`data_path'working/sdid_analysis_data.d
> ta", clear
 13. 
.         ** Define sample
.         gen sample = `samp_var' == 1 & `data_var' ==
>  1
 14.         if `exl' == 1 replace sample = 0 if year 
> == 2020
 15. 
.         ** Skip if no treated unit in sample
.         qui count if multnomah == 1 & sample == 1
 16.         if r(N) == 0 {
 17.                 dis "Skipping table `table_id': n
> o treated unit in sample"
 18.                 exit
 19.         }
 20. 
.         ** Create output directory
.         capture mkdir "`results_path'sdid/`out_txt'"
 21. 
.         ** Define covariates
.         local covariates "population per_capita_inco
> me"
 22. 
.         ** Clear stored estimates
.         eststo clear
 23. 
.         ** Loop over outcomes (n1, n2, agi) and cova
> riate settings (0, 1)
.         foreach outvar in "n1" "n2" "agi" {
 24. 
.                 ** Full outcome variable name
.                 local outcome "`outvar'_`migr'_rate_
> `out_type'"
 25. 
.                 ** Store label
.                 local label : variable label `outcom
> e'
 26. 
.                 ** Loop over covariate settings
.                 forvalues c = 0/1 {
 27. 
.                         ** Covariates
.                         if `c' == 0 local covars ""
 28.                         else if `c' == 1 local co
> vars "covariates(`covariates', projected)"
 29. 
.                         ** File paths for figures
.                         if `exl' == 0 local path "`r
> esults_path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`
> c'_`samp_var'_"
 30.                         if `exl' == 1 local path 
> "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome
> '_`c'_`samp_var'_excl2020_"
 31. 
.                         ** Run SDID
.                         capture noisily {
 32.                                 eststo sdid_`outv
> ar'_`c': sdid `outcome' fips year Treated      ///
>                                         if sample ==
>  1,                         ///
>                                         vce(placebo)
>                             ///
>                                         `covars'    
>                                     ///
>                                         reps(`reps')
>                             ///
>                                         graph graph_
> export("`path'", .pdf)
 33.                         }
 34. 
.                         if _rc != 0 {
 35.                                 dis "SDID failed 
> for `outcome' with covars=`c'"
 36.                                 continue
 37.                         }
 38. 
.                         ** Store results
.                         local tmp_tau = e(ATT)
 39.                         local tmp_se = e(se)
 40.                         matrix omega = e(omega)
 41. 
.                         ** Pre-treatment mean and co
> unty count
.                         qui summ `outcome' if multno
> mah == 1 & Treated == 0
 42.                         local tmp_premean = r(mea
> n)
 43.                         estadd scalar mean = r(me
> an)
 44. 
.                         qui summ `outcome' if year =
> = 2021 & sample == 1
 45.                         local tmp_ncounties = r(N
> )
 46.                         estadd scalar count = r(N
> )
 47. 
.                         ** Save treatment effect res
> ults
.                         preserve
 48.                         clear
 49.                         set obs 1
 50.                         gen table_id = `table_id'
 51.                         gen sample_data = "`out_t
> xt'"
 52.                         gen sample = "`samp_var'"
 53.                         gen outcome = "`outcome'"
 54.                         gen controls = `c'
 55.                         gen exclusion = `exl'
 56.                         gen tau = `tmp_tau'
 57.                         gen se = `tmp_se'
 58.                         gen pval = 2 * (1 - norma
> l(abs(tau/se)))
 59.                         gen ci_lower = tau - 1.96
>  * se
 60.                         gen ci_upper = tau + 1.96
>  * se
 61.                         gen n_counties = `tmp_nco
> unties'
 62.                         gen pre_mean = `tmp_preme
> an'
 63.                         save "`results_path'sdid/
> temp_results/results_`table_id'_`outvar'_`c'.dta", r
> eplace
 64.                         restore
 65. 
.                         ** Save weights
.                         preserve
 66.                         clear
 67.                         svmat double omega, names
> (col)
 68.                         rename c2 fips
 69.                         rename c1 weight
 70.                         gen table_id = `table_id'
 71.                         gen sample_data = "`out_t
> xt'"
 72.                         gen out = "`outcome'"
 73.                         gen sample = "`samp_var'"
 74.                         gen controls = `c'
 75.                         gen exclusion = `exl'
 76.                         drop if weight == 0
 77.                         drop if missing(fips)
 78.                         save "`results_path'sdid/
> temp_weights/weights_`table_id'_`outvar'_`c'.dta", r
> eplace
 79.                         restore
 80. 
.                         ** Run event study
.                         capture noisily {
 81.                                 sdid_event `outco
> me' fips year Treated  ///
>                                         if sample ==
>  1,                                         ///
>                                         `covars'    
>                                                     
> ///
>                                         vce(placebo)
>                                             ///
>                                         brep(`reps')
>                                             ///
>                                         placebo(all)
 82.                         }
 83. 
.                         if _rc == 0 {
 84.                                 ** Store max year
.                                 qui summ year if mul
> tnomah == 1 & sample == 1
 85.                                 local max_yr = r(
> max)
 86. 
.                                 ** Move results from
>  matrix to data
.                                 qui count if multnom
> ah == 1 & sample == 1
 87.                                 local ct = r(N)
 88.                                 local ct = `ct' +
>  1
 89.                                 mat res = e(H)[2.
> .`ct',1..5]
 90. 
.                                 ** Move to data
.                                 svmat res
 91. 
.                                 ** Generate ID varia
> ble
.                                 gen id = `max_yr' - 
> _n + 1 if !missing(res1)
 92. 
.                                 ** Handle exclusion 
> year labeling
.                                 if `exl' == 1 {
 93.                                         replace i
> d = id - 1 if id <= 2020
 94.                                         expand 2 
> if id == 2019, gen(tag)
 95.                                         replace i
> d = 2020 if tag == 1
 96.                                         replace r
> es1 = . if tag == 1
 97.                                         replace r
> es3 = . if tag == 1
 98.                                         replace r
> es4 = . if tag == 1
 99.                                 }
100.                                 label var id "Yea
> r (destination)"
101. 
.                                 ** Sort
.                                 sort id
102. 
.                                 ** Plot
.                                 twoway  (rcap res3 r
> es4 id, lc(gs10) fc(gs11%50))       ///
>                                                 (sca
> tter res1 id, mc(black)),                           
> ///
>                                         legend(off) 
> ytitle("`label'")                                   
> ///
>                                         yline(0, lc(
> red) lp(-))                                         
>         ///
>                                         xline(2020.5
> , lc(black) lp(solid))                              
> ///
>                                         ylabel(-10(2
> .5)10, format(%9.1f))
103. 
.                                 if `exl' == 0 local 
> evpath "`results_path'sdid/`out_txt'/fig_`out_txt'_`
> outcome'_`c'_`samp_var'_eventstudy.jpg"
104.                                 if `exl' == 1 loc
> al evpath "`results_path'sdid/`out_txt'/fig_`out_txt
> '_`outcome'_`c'_`samp_var'_excl2020_eventstudy.jpg"
105. 
.                                 graph export "`evpat
> h'", as(jpg) name("Graph") quality(100) replace
106. 
.                                 ** Clean up
.                                 drop res1 res2 res3 
> res4 res5 id
107.                                 capture drop tag
108.                         }
109. 
.                 } // END COVAR LOOP
110. 
.         } // END OUTCOME LOOP
111. 
.         ** Generate table for this migration type (a
> ll 6 specs)
.         ** Determine table path
.         if `exl' == 0 local tabpath "`results_path's
> did/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var'.t
> ex"
112.         if `exl' == 1 local tabpath "`results_pat
> h'sdid/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var
> '_excl2020.tex"
113. 
.         ** Check if we have all estimates
.         capture confirm matrix e(b)
114. 
.         ** Generate table based on data type
.         if "`data_var'" == "irs_sample_1" | "`data_v
> ar'" == "irs_sample_2" {
115.                 capture noisily {
116.                         esttab  sdid_n1_0 sdid_n1
> _1     ///
>                                         sdid_n2_0 sd
> id_n2_1     ///
>                                         sdid_agi_0 s
> did_agi_1 ///
>                                 using "`tabpath'",  
>                                                     
>         ///
>                                 starlevel("*" 0.10 "
> **" 0.05 "***" 0.01)                ///
>                                 b(%-9.3f) se(%-9.3f)
>  replace                                    ///
>                                 mgroups("Returns" "E
> xemptions" "AGI",                   ///
>                                         pattern(1 0 
> 1 0 1 0) )                                          
> ///
>                                 mtitle( "No Covariat
> es" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates")                   ///
>                                 stats(count mean,   
>                                                     
>         ///
>                                         fmt(%9.0fc %
> 9.3fc)                                              
>         ///
>                                         labels("Numb
> er of Counties" "Pre-treatment mean"))
117.                 }
118.         }
119.         else {
120.                 capture noisily {
121.                         esttab  sdid_n1_0 sdid_n1
> _1     ///
>                                         sdid_n2_0 sd
> id_n2_1     ///
>                                         sdid_agi_0 s
> did_agi_1 ///
>                                 using "`tabpath'",  
>                                                     
>         ///
>                                 starlevel("*" 0.10 "
> **" 0.05 "***" 0.01)                ///
>                                 b(%-9.3f) se(%-9.3f)
>  replace                                    ///
>                                 mgroups("Households"
>  "Adults" "Household Income",       ///
>                                         pattern(1 0 
> 1 0 1 0) )                                          
> ///
>                                 mtitle( "No Covariat
> es" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates")                   ///
>                                 stats(count mean,   
>                                                     
>         ///
>                                         fmt(%9.0fc %
> 9.3fc)                                              
>         ///
>                                         labels("Numb
> er of Counties" "Pre-treatment mean"))
122.                 }
123.         }
124. 
.         dis "Completed table `table_id': `out_txt' /
>  `migr' / `samp_var' / excl=`exl'"
125. 
. end

. 
. /***************************************************
> ****************************
> SECTION 5: CREATE TEMPORARY DIRECTORIES AND RUN PARA
> LLEL ESTIMATION
> ****************************************************
> ***************************/
. 
. ** Create temp directories for results
. capture mkdir "${results}sdid/temp_results"

. capture mkdir "${results}sdid/temp_weights"

. 
. ** Create subfolders for each output type
. foreach out_txt in "irs_full_16_22" "irs_389_16_22" 
> "acs_16_22_all" "acs_16_22_col" "acs_16_24_all" "acs
> _16_24_col" {
  2.         capture mkdir "${results}sdid/`out_txt'"
  3. }

. 
. ** Load table grid
. use "${data}working/table_grid.dta", clear

. local n_tables = _N

. dis "Running `n_tables' table units in parallel (eac
> h with 6 SDID specs)..."
Running 108 table units in parallel (each with 6 SDID 
> specs)...

. 
. ** Save table IDs for parallel processing
. preserve

. keep table_id

. save "${data}working/table_ids.dta", replace
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_ids.dta saved

. restore

. 
. ** Define wrapper program for parallel execution
. capture program drop parallel_sdid_wrapper

. program define parallel_sdid_wrapper
  1.         ** Loop through all observations in this 
> chunk
.         local n_obs = _N
  2.         forvalues i = 1/`n_obs' {
  3.                 local table_id = table_id[`i']
  4.                 dis "Worker processing table `tab
> le_id' (`i' of `n_obs' in this chunk)"
  5.                 run_sdid_table, table_id(`table_i
> d') data_path("${data}") results_path("${results}") 
> reps(100)
  6.         }
  7. end

. 
. ** Load table IDs and run in parallel
. use "${data}working/table_ids.dta", clear

. 
. ** Run parallel estimation
. dis "Starting parallel SDID estimation at $S_TIME...
> "
Starting parallel SDID estimation at 22:12:25...

. dis "Each parallel worker processes one table (6 SDI
> D specifications)"
Each parallel worker processes one table (6 SDID speci
> fications)

. timer clear 1

. timer on 1

. 
. parallel, prog(parallel_sdid_wrapper run_sdid_table)
> : parallel_sdid_wrapper
------------------------------------------------------
> --------------------------
Exporting the following program(s): parallel_sdid_wrap
> per run_sdid_table

parallel_sdid_wrapper:
  1.         local n_obs = _N
  2.         forvalues i = 1/`n_obs' {
  3.                 local table_id = table_id[`i']
  4.                 dis "Worker processing table `tab
> le_id' (`i' of `n_obs' in this chunk)"
  5.                 run_sdid_table, table_id(`table_i
> d') data_path("${data}") results_path("${results}") 
> reps(100)
  6.         }

run_sdid_table:
  1.         syntax, table_id(integer) data_path(strin
> g) results_path(string) reps(integer)
  2.         preserve
  3.         use "`data_path'working/table_grid.dta", 
> clear
  4.         keep if table_id == `table_id'
  5.         local data_var = data_var[1]
  6.         local out_type = out_type[1]
  7.         local out_txt = out_txt[1]
  8.         local samp_var = samp_var[1]
  9.         local exl = exclusion[1]
 10.         local migr = migr_type[1]
 11.         restore
 12.         use "`data_path'working/sdid_analysis_dat
> a.dta", clear
 13.         gen sample = `samp_var' == 1 & `data_var'
>  == 1
 14.         if `exl' == 1 replace sample = 0 if year 
> == 2020
 15.         qui count if multnomah == 1 & sample == 1
 16.         if r(N) == 0 {
 17.                 dis "Skipping table `table_id': n
> o treated unit in sample"
 18.                 exit
 19.         }
 20.         capture mkdir "`results_path'sdid/`out_tx
> t'"
 21.         local covariates "population per_capita_i
> ncome"
 22.         eststo clear
 23.         foreach outvar in "n1" "n2" "agi" {
 24.                 local outcome "`outvar'_`migr'_ra
> te_`out_type'"
 25.                 local label : variable label `out
> come'
 26.                 forvalues c = 0/1 {
 27.                         if `c' == 0 local covars 
> ""
 28.                         else if `c' == 1 local co
> vars "covariates(`covariates', projected)"
 29.                         if `exl' == 0 local path 
> "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome
> '_`c'_`samp_var'_"
 30.                         if `exl' == 1 local path 
> "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome
> '_`c'_`samp_var'_excl2020_"
 31.                         capture noisily {
 32.                                 eststo sdid_`outv
> ar'_`c': sdid `outcome' fips year Treated if sample 
> == 1, vce(placebo) `covars' reps(`reps') graph graph
> _export("`path'", .pdf)
 33.                         }
 34.                         if _rc != 0 {
 35.                                 dis "SDID failed 
> for `outcome' with covars=`c'"
 36.                                 continue
 37.                         }
 38.                         local tmp_tau = e(ATT)
 39.                         local tmp_se = e(se)
 40.                         matrix omega = e(omega)
 41.                         qui summ `outcome' if mul
> tnomah == 1 & Treated == 0
 42.                         local tmp_premean = r(mea
> n)
 43.                         estadd scalar mean = r(me
> an)
 44.                         qui summ `outcome' if yea
> r == 2021 & sample == 1
 45.                         local tmp_ncounties = r(N
> )
 46.                         estadd scalar count = r(N
> )
 47.                         preserve
 48.                         clear
 49.                         set obs 1
 50.                         gen table_id = `table_id'
 51.                         gen sample_data = "`out_t
> xt'"
 52.                         gen sample = "`samp_var'"
 53.                         gen outcome = "`outcome'"
 54.                         gen controls = `c'
 55.                         gen exclusion = `exl'
 56.                         gen tau = `tmp_tau'
 57.                         gen se = `tmp_se'
 58.                         gen pval = 2 * (1 - norma
> l(abs(tau/se)))
 59.                         gen ci_lower = tau - 1.96
>  * se
 60.                         gen ci_upper = tau + 1.96
>  * se
 61.                         gen n_counties = `tmp_nco
> unties'
 62.                         gen pre_mean = `tmp_preme
> an'
 63.                         save "`results_path'sdid/
> temp_results/results_`table_id'_`outvar'_`c'.dta", r
> eplace
 64.                         restore
 65.                         preserve
 66.                         clear
 67.                         svmat double omega, names
> (col)
 68.                         rename c2 fips
 69.                         rename c1 weight
 70.                         gen table_id = `table_id'
 71.                         gen sample_data = "`out_t
> xt'"
 72.                         gen out = "`outcome'"
 73.                         gen sample = "`samp_var'"
 74.                         gen controls = `c'
 75.                         gen exclusion = `exl'
 76.                         drop if weight == 0
 77.                         drop if missing(fips)
 78.                         save "`results_path'sdid/
> temp_weights/weights_`table_id'_`outvar'_`c'.dta", r
> eplace
 79.                         restore
 80.                         capture noisily {
 81.                                 sdid_event `outco
> me' fips year Treated if sample == 1, `covars' vce(p
> lacebo) brep(`reps') placebo(all)
 82.                         }
 83.                         if _rc == 0 {
 84.                                 qui summ year if 
> multnomah == 1 & sample == 1
 85.                                 local max_yr = r(
> max)
 86.                                 qui count if mult
> nomah == 1 & sample == 1
 87.                                 local ct = r(N)
 88.                                 local ct = `ct' +
>  1
 89.                                 mat res = e(H)[2.
> .`ct',1..5]
 90.                                 svmat res
 91.                                 gen id = `max_yr'
>  - _n + 1 if !missing(res1)
 92.                                 if `exl' == 1 {
 93.                                         replace i
> d = id - 1 if id <= 2020
 94.                                         expand 2 
> if id == 2019, gen(tag)
 95.                                         replace i
> d = 2020 if tag == 1
 96.                                         replace r
> es1 = . if tag == 1
 97.                                         replace r
> es3 = . if tag == 1
 98.                                         replace r
> es4 = . if tag == 1
 99.                                 }
100.                                 label var id "Yea
> r (destination)"
101.                                 sort id
102.                                 twoway (rcap res3
>  res4 id, lc(gs10) fc(gs11%50)) (scatter res1 id, mc
> (black)), legend(off) ytitle("`label'") yline(0, lc(
> red) lp(-)) xline(2020.5, lc(black) lp(solid)) ylabe
> l(-10(2.5)10, format(%9.1f))
103.                                 if `exl' == 0 loc
> al evpath "`results_path'sdid/`out_txt'/fig_`out_txt
> '_`outcome'_`c'_`samp_var'_eventstudy.jpg"
104.                                 if `exl' == 1 loc
> al evpath "`results_path'sdid/`out_txt'/fig_`out_txt
> '_`outcome'_`c'_`samp_var'_excl2020_eventstudy.jpg"
105.                                 graph export "`ev
> path'", as(jpg) name("Graph") quality(100) replace
106.                                 drop res1 res2 re
> s3 res4 res5 id
107.                                 capture drop tag
108.                         }
109.                 }
110.         }
111.         if `exl' == 0 local tabpath "`results_pat
> h'sdid/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var
> '.tex"
112.         if `exl' == 1 local tabpath "`results_pat
> h'sdid/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var
> '_excl2020.tex"
113.         capture confirm matrix e(b)
114.         if "`data_var'" == "irs_sample_1" | "`dat
> a_var'" == "irs_sample_2" {
115.                 capture noisily {
116.                         esttab sdid_n1_0 sdid_n1_
> 1 sdid_n2_0 sdid_n2_1 sdid_agi_0 sdid_agi_1 using "`
> tabpath'", starlevel("*" 0.10 "**" 0.05 "***" 0.01) 
> b(%-9.3f) se(%-9.3f) replace mgroups("Returns" "Exem
> ptions" "AGI", pattern(1 0 1 0 1 0) ) mtitle( "No Co
> variates" "Covariates" "No Covariates" "Covariates" 
> "No Covariates" "Covariates") stats(count mean, fmt(
> %9.0fc %9.3fc) labels("Number of Counties" "Pre-trea
> tment mean"))
117.                 }
118.         }
119.         else {
120.                 capture noisily {
121.                         esttab sdid_n1_0 sdid_n1_
> 1 sdid_n2_0 sdid_n2_1 sdid_agi_0 sdid_agi_1 using "`
> tabpath'", starlevel("*" 0.10 "**" 0.05 "***" 0.01) 
> b(%-9.3f) se(%-9.3f) replace mgroups("Households" "A
> dults" "Household Income", pattern(1 0 1 0 1 0) ) mt
> itle( "No Covariates" "Covariates" "No Covariates" "
> Covariates" "No Covariates" "Covariates") stats(coun
> t mean, fmt(%9.0fc %9.3fc) labels("Number of Countie
> s" "Pre-treatment mean"))
122.                 }
123.         }
124.         dis "Completed table `table_id': `out_txt
> ' / `migr' / `samp_var' / excl=`exl'"
------------------------------------------------------
> --------------------------
------------------------------------------------------
Parallel Computing with Stata
Child processes: 6
pll_id         : radxg3et65
Running at     : C:\Users\ji252\Documents\GitHub\multn
> omah-county-tax
Randtype       : datetime
Waiting for the child processes to finish...
child process 0004 Exited with error -111- while runni
> ng the command/dofile (view log)...
child process 0003 Exited with error -111- while runni
> ng the command/dofile (view log)...
child process 0002 Exited with error -111- while runni
> ng the command/dofile (view log)...
child process 0005 Exited with error -111- while runni
> ng the command/dofile (view log)...
child process 0006 Exited with error -111- while runni
> ng the command/dofile (view log)...
The user pressed -break-. Trying to stop the child pro
> cesses...
                 stata():  3598  Stata returned error
       parallel_finito():     -  function returned err
> or
          parallel_run():     -  function returned err
> or
                 <istmt>:     -  function returned err
> or
r(3598);

end of do-file

r(3598);

. parallel viewlog 6, e(radxg3et65)

. do "C:\Users\ji252\Documents\GitHub\multnomah-county
> -tax\code\02_sdid_analysis_parallel.do"

. /***************************************************
> ****************************
> File Name:              02_sdid_analysis_parallel.do
> Creator:                John Iselin (parallelized ve
> rsion)
> Date Update:    January 13, 2025
> 
> Called by: 00_multnomah.do
> 
> Purpose: Perform synthetic difference-in-difference 
> estimation using parallel
>          processing to speed up computation across m
> ultiple specifications.
> 
>          Each parallel child runs all 6 specificatio
> ns for one table:
>          - 3 outcome variables (n1, n2, agi) for a g
> iven migration type
>          - Each with 2 covariate settings (with/with
> out controls)
>          This allows tables to be generated within e
> ach child process.
> 
> Requirements:
> - parallel package: net install parallel, from(https
> ://raw.github.com/gvegayon/parallel/stable/) replace
> 
> Outputs:
> - sdid_weights.dta/xlsx: Synthetic control weights f
> or each specification
> - sdid_results.dta/xlsx: Treatment effects, SEs, p-v
> alues for each specification
> - tab_sdid_*.tex: LaTeX tables for each specificatio
> n group
> - fig_speccurve_*.pdf/jpg: Specification curve plots
> 
> Authors: John Iselin
> 
> For more information, contact john.iselin@yale.edu
> 
> ****************************************************
> ***************************/
. 
. ** Start log file
. capture log close log_02

. log using "${logs}02_log_sdid_parallel_${date}", rep
> lace text name(log_02)
------------------------------------------------------
      name:  log_02
       log:  C:/Users/ji252/Documents/GitHub/multnomah
> -county-tax/code/logs/02_log_sdid_parallel_2026-01-1
> 3.log
  log type:  text
 opened on:  14 Jan 2026, 07:15:03

. 
. /***************************************************
> ****************************
> SECTION 1: SETUP AND CONFIGURATION
> ****************************************************
> ***************************/
. 
. ** Set number of parallel clusters (adjust based on 
> your machine)
. ** Use fewer than total cores to leave resources for
>  system
. local n_clusters = 6

. 
. ** Parameters
. local reps = 100

. 
. ** Initialize parallel processing
. parallel initialize `n_clusters', force
N Child processes: 6
Stata dir:  C:\Program Files\StataNow19/StataMP-64.exe

. 
. /***************************************************
> ****************************
> SECTION 2: DATA PREPARATION
> (Same as original - prepares main analysis dataset)
> ****************************************************
> ***************************/
. 
. ** Load data
. use "${data}working/irs_county_gross", replace

. 
. ** Keep required variables
. keep year fips state* county* *_net_3 *_out_1 *_out_
> 2 *_in_3 *_out_3

. order year fips state* county*

. 
. ** Merge with ACS Data
. merge 1:1 year fips using "${data}working/acs_county
> _gross_18plus", gen(merge_acs_1)
(variable fips was float, now double to accommodate
       using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        20,771
        from master                    18,963  (merge_
> acs_1==1)
        from using                      1,808  (merge_
> acs_1==2)

    Matched                             3,017  (merge_
> acs_1==3)
    -----------------------------------------

. 
. ** Keep require variables
. keep year fips state* county* *_net_3 *_out_1 *_out_
> 2 *_in_3 *_out_3 merge_acs_*

. 
. ** Label acs samples
. rename persons_* acs1_persons_*

. rename households_* acs1_households_*

. rename dollars_* acs1_dollars_*

. 
. ** Merge with ACS Data
. merge 1:1 year fips using "${data}working/acs_county
> _gross_college", gen(merge_acs_2)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        18,963
        from master                    18,963  (merge_
> acs_2==1)
        from using                          0  (merge_
> acs_2==2)

    Matched                             4,825  (merge_
> acs_2==3)
    -----------------------------------------

. 
. ** Keep require variables
. keep year fips state* county* *_net_3 *_out_1 *_out_
> 2 *_in_3 *_out_3  merge_acs_*

. 
. ** Label acs samples
. rename persons_* acs2_persons_*

. rename households_* acs2_households_*

. rename dollars_* acs2_dollars_*

. 
. ** Drop "other counties"
. drop if county_fips == 0
(483 observations deleted)

. drop if year == 2015
(430 observations deleted)

. 
. ** Merge with Demographic data
. merge m:1 fips using "${data}working/demographics_20
> 20",        ///
>         gen(demo_merge) keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            27
        from master                        27  (demo_m
> erge==1)
        from using                          0  (demo_m
> erge==2)

    Matched                            22,848  (demo_m
> erge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name demo_merge, m

                     |  Matching
                     |   result
                     | from merge
          State name | Master on |     Total
---------------------+-----------+----------
                     |        21 |        21 
             Alabama |         0 |       479 
              Alaska |         6 |       204 
             Arizona |         0 |       113 
            Arkansas |         0 |       531 
          California |         0 |       474 
            Colorado |         0 |       452 
         Connecticut |         0 |        48 
            Delaware |         0 |        27 
District of Columbia |         0 |         9 
             Florida |         0 |       535 
             Georgia |         0 |     1,157 
              Hawaii |         0 |        34 
               Idaho |         0 |       310 
            Illinois |         0 |       740 
             Indiana |         0 |       676 
                Iowa |         0 |       703 
              Kansas |         0 |       741 
            Kentucky |         0 |       854 
           Louisiana |         0 |       462 
               Maine |         0 |       116 
            Maryland |         0 |       190 
       Massachusetts |         0 |       116 
            Michigan |         0 |       613 
           Minnesota |         0 |       625 
         Mississippi |         0 |       580 
            Missouri |         0 |       819 
             Montana |         0 |       394 
            Nebraska |         0 |       657 
              Nevada |         0 |       123 
       New Hampshire |         0 |        70 
          New Jersey |         0 |       181 
          New Mexico |         0 |       235 
            New York |         0 |       476 
      North Carolina |         0 |       736 
        North Dakota |         0 |       373 
                Ohio |         0 |       658 
            Oklahoma |         0 |       547 
              Oregon |         0 |       268 
        Pennsylvania |         0 |       509 
        Rhode Island |         0 |        41 
      South Carolina |         0 |       338 
        South Dakota |         0 |       462 
           Tennessee |         0 |       687 
               Texas |         0 |     1,854 
                Utah |         0 |       213 
             Vermont |         0 |       100 
            Virginia |         0 |       951 
          Washington |         0 |       293 
       West Virginia |         0 |       387 
           Wisconsin |         0 |       530 
             Wyoming |         0 |       163 
---------------------+-----------+----------
               Total |        27 |    22,875 


                     |  Matching
                     |   result
                     | from merge
          State name | Matched ( |     Total
---------------------+-----------+----------
                     |         0 |        21 
             Alabama |       479 |       479 
              Alaska |       198 |       204 
             Arizona |       113 |       113 
            Arkansas |       531 |       531 
          California |       474 |       474 
            Colorado |       452 |       452 
         Connecticut |        48 |        48 
            Delaware |        27 |        27 
District of Columbia |         9 |         9 
             Florida |       535 |       535 
             Georgia |     1,157 |     1,157 
              Hawaii |        34 |        34 
               Idaho |       310 |       310 
            Illinois |       740 |       740 
             Indiana |       676 |       676 
                Iowa |       703 |       703 
              Kansas |       741 |       741 
            Kentucky |       854 |       854 
           Louisiana |       462 |       462 
               Maine |       116 |       116 
            Maryland |       190 |       190 
       Massachusetts |       116 |       116 
            Michigan |       613 |       613 
           Minnesota |       625 |       625 
         Mississippi |       580 |       580 
            Missouri |       819 |       819 
             Montana |       394 |       394 
            Nebraska |       657 |       657 
              Nevada |       123 |       123 
       New Hampshire |        70 |        70 
          New Jersey |       181 |       181 
          New Mexico |       235 |       235 
            New York |       476 |       476 
      North Carolina |       736 |       736 
        North Dakota |       373 |       373 
                Ohio |       658 |       658 
            Oklahoma |       547 |       547 
              Oregon |       268 |       268 
        Pennsylvania |       509 |       509 
        Rhode Island |        41 |        41 
      South Carolina |       338 |       338 
        South Dakota |       462 |       462 
           Tennessee |       687 |       687 
               Texas |     1,854 |     1,854 
                Utah |       213 |       213 
             Vermont |       100 |       100 
            Virginia |       951 |       951 
          Washington |       293 |       293 
       West Virginia |       387 |       387 
           Wisconsin |       530 |       530 
             Wyoming |       163 |       163 
---------------------+-----------+----------
               Total |    22,848 |    22,875 

. tab year demo_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |         0      3,140 |     3,140 
      2017 |         0      3,140 |     3,140 
      2018 |         0      3,140 |     3,140 
      2019 |         0      3,140 |     3,140 
      2020 |         2      3,140 |     3,142 
      2021 |         2      3,141 |     3,143 
      2022 |         9      3,133 |     3,142 
      2023 |         7        437 |       444 
      2024 |         7        437 |       444 
-----------+----------------------+----------
     Total |        27     22,848 |    22,875 

. 
. ** Keep if matched
. keep if demo_merge == 3
(27 observations deleted)

. drop demo_merge

. 
. ** Rename
. rename population pop_census

. 
. ** Merge with Demographic data
. merge m:1 year fips using "${data}working/bea_econom
> ics",       ///
>         gen(econ_merge) keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           366
        from master                       366  (econ_m
> erge==1)
        from using                          0  (econ_m
> erge==2)

    Matched                            22,482  (econ_m
> erge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name econ_merge, m

                     |  Matching
                     |   result
                     | from merge
          State name | Master on |     Total
---------------------+-----------+----------
             Alabama |         0 |       479 
              Alaska |         0 |       198 
             Arizona |         0 |       113 
            Arkansas |         0 |       531 
          California |         0 |       474 
            Colorado |         0 |       452 
         Connecticut |         0 |        48 
            Delaware |         0 |        27 
District of Columbia |         0 |         9 
             Florida |         0 |       535 
             Georgia |         0 |     1,157 
              Hawaii |         9 |        34 
               Idaho |         0 |       310 
            Illinois |         0 |       740 
             Indiana |         0 |       676 
                Iowa |         0 |       703 
              Kansas |         0 |       741 
            Kentucky |         0 |       854 
           Louisiana |         0 |       462 
               Maine |         0 |       116 
            Maryland |         0 |       190 
       Massachusetts |         0 |       116 
            Michigan |         0 |       613 
           Minnesota |         0 |       625 
         Mississippi |         0 |       580 
            Missouri |         0 |       819 
             Montana |         0 |       394 
            Nebraska |         0 |       657 
              Nevada |         0 |       123 
       New Hampshire |         0 |        70 
          New Jersey |         0 |       181 
          New Mexico |         0 |       235 
            New York |         0 |       476 
      North Carolina |         0 |       736 
        North Dakota |         0 |       373 
                Ohio |         0 |       658 
            Oklahoma |         0 |       547 
              Oregon |         0 |       268 
        Pennsylvania |         0 |       509 
        Rhode Island |         0 |        41 
      South Carolina |         0 |       338 
        South Dakota |         0 |       462 
           Tennessee |         0 |       687 
               Texas |         0 |     1,854 
                Utah |         0 |       213 
             Vermont |         0 |       100 
            Virginia |       357 |       951 
          Washington |         0 |       293 
       West Virginia |         0 |       387 
           Wisconsin |         0 |       530 
             Wyoming |         0 |       163 
---------------------+-----------+----------
               Total |       366 |    22,848 


                     |  Matching
                     |   result
                     | from merge
          State name | Matched ( |     Total
---------------------+-----------+----------
             Alabama |       479 |       479 
              Alaska |       198 |       198 
             Arizona |       113 |       113 
            Arkansas |       531 |       531 
          California |       474 |       474 
            Colorado |       452 |       452 
         Connecticut |        48 |        48 
            Delaware |        27 |        27 
District of Columbia |         9 |         9 
             Florida |       535 |       535 
             Georgia |     1,157 |     1,157 
              Hawaii |        25 |        34 
               Idaho |       310 |       310 
            Illinois |       740 |       740 
             Indiana |       676 |       676 
                Iowa |       703 |       703 
              Kansas |       741 |       741 
            Kentucky |       854 |       854 
           Louisiana |       462 |       462 
               Maine |       116 |       116 
            Maryland |       190 |       190 
       Massachusetts |       116 |       116 
            Michigan |       613 |       613 
           Minnesota |       625 |       625 
         Mississippi |       580 |       580 
            Missouri |       819 |       819 
             Montana |       394 |       394 
            Nebraska |       657 |       657 
              Nevada |       123 |       123 
       New Hampshire |        70 |        70 
          New Jersey |       181 |       181 
          New Mexico |       235 |       235 
            New York |       476 |       476 
      North Carolina |       736 |       736 
        North Dakota |       373 |       373 
                Ohio |       658 |       658 
            Oklahoma |       547 |       547 
              Oregon |       268 |       268 
        Pennsylvania |       509 |       509 
        Rhode Island |        41 |        41 
      South Carolina |       338 |       338 
        South Dakota |       462 |       462 
           Tennessee |       687 |       687 
               Texas |     1,854 |     1,854 
                Utah |       213 |       213 
             Vermont |       100 |       100 
            Virginia |       594 |       951 
          Washington |       293 |       293 
       West Virginia |       387 |       387 
           Wisconsin |       530 |       530 
             Wyoming |       163 |       163 
---------------------+-----------+----------
               Total |    22,482 |    22,848 

. tab year econ_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |        52      3,088 |     3,140 
      2017 |        52      3,088 |     3,140 
      2018 |        52      3,088 |     3,140 
      2019 |        52      3,088 |     3,140 
      2020 |        52      3,088 |     3,140 
      2021 |        53      3,088 |     3,141 
      2022 |        53      3,080 |     3,133 
      2023 |         0        437 |       437 
      2024 |         0        437 |       437 
-----------+----------------------+----------
     Total |       366     22,482 |    22,848 

. 
. ** Keep if matched
. keep if econ_merge == 3
(366 observations deleted)

. drop econ_merge

. 
. ** Merge with COVID-19 Data
. merge m:1 fips using ${data}working/covid_cleaned_wi
> de.dta,     ///
>         gen(covid_merge) keep(master match )
(variable state_name was str20, now str24 to
       accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            73
        from master                        73  (covid_
> merge==1)
        from using                          0  (covid_
> merge==2)

    Matched                            22,409  (covid_
> merge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name covid_merge, m

                      |  Matching
                      |   result
                      | from merge
           State name | Master on |     Total
----------------------+-----------+----------
              Alabama |         0 |       479 
               Alaska |        28 |       198 
              Arizona |         0 |       113 
             Arkansas |         0 |       531 
           California |         0 |       474 
             Colorado |         0 |       452 
          Connecticut |         0 |        48 
             Delaware |         0 |        27 
 District of Columbia |         0 |         9 
              Florida |         0 |       535 
              Georgia |         0 |     1,157 
               Hawaii |         0 |        25 
                Idaho |         0 |       310 
             Illinois |         0 |       740 
              Indiana |         0 |       676 
                 Iowa |         0 |       703 
               Kansas |         0 |       741 
             Kentucky |         0 |       854 
            Louisiana |         0 |       462 
                Maine |         0 |       116 
             Maryland |         0 |       190 
        Massachusetts |         0 |       116 
             Michigan |         0 |       613 
            Minnesota |         0 |       625 
          Mississippi |         0 |       580 
             Missouri |         0 |       819 
              Montana |         0 |       394 
             Nebraska |         0 |       657 
               Nevada |         0 |       123 
        New Hampshire |         0 |        70 
           New Jersey |         0 |       181 
           New Mexico |         0 |       235 
             New York |        45 |       476 
       North Carolina |         0 |       736 
         North Dakota |         0 |       373 
                 Ohio |         0 |       658 
             Oklahoma |         0 |       547 
               Oregon |         0 |       268 
         Pennsylvania |         0 |       509 
         Rhode Island |         0 |        41 
       South Carolina |         0 |       338 
         South Dakota |         0 |       462 
            Tennessee |         0 |       687 
                Texas |         0 |     1,854 
                 Utah |         0 |       213 
              Vermont |         0 |       100 
             Virginia |         0 |       594 
           Washington |         0 |       293 
        West Virginia |         0 |       387 
            Wisconsin |         0 |       530 
              Wyoming |         0 |       163 
----------------------+-----------+----------
                Total |        73 |    22,482 


                      |  Matching
                      |   result
                      | from merge
           State name | Matched ( |     Total
----------------------+-----------+----------
              Alabama |       479 |       479 
               Alaska |       170 |       198 
              Arizona |       113 |       113 
             Arkansas |       531 |       531 
           California |       474 |       474 
             Colorado |       452 |       452 
          Connecticut |        48 |        48 
             Delaware |        27 |        27 
 District of Columbia |         9 |         9 
              Florida |       535 |       535 
              Georgia |     1,157 |     1,157 
               Hawaii |        25 |        25 
                Idaho |       310 |       310 
             Illinois |       740 |       740 
              Indiana |       676 |       676 
                 Iowa |       703 |       703 
               Kansas |       741 |       741 
             Kentucky |       854 |       854 
            Louisiana |       462 |       462 
                Maine |       116 |       116 
             Maryland |       190 |       190 
        Massachusetts |       116 |       116 
             Michigan |       613 |       613 
            Minnesota |       625 |       625 
          Mississippi |       580 |       580 
             Missouri |       819 |       819 
              Montana |       394 |       394 
             Nebraska |       657 |       657 
               Nevada |       123 |       123 
        New Hampshire |        70 |        70 
           New Jersey |       181 |       181 
           New Mexico |       235 |       235 
             New York |       431 |       476 
       North Carolina |       736 |       736 
         North Dakota |       373 |       373 
                 Ohio |       658 |       658 
             Oklahoma |       547 |       547 
               Oregon |       268 |       268 
         Pennsylvania |       509 |       509 
         Rhode Island |        41 |        41 
       South Carolina |       338 |       338 
         South Dakota |       462 |       462 
            Tennessee |       687 |       687 
                Texas |     1,854 |     1,854 
                 Utah |       213 |       213 
              Vermont |       100 |       100 
             Virginia |       594 |       594 
           Washington |       293 |       293 
        West Virginia |       387 |       387 
            Wisconsin |       530 |       530 
              Wyoming |       163 |       163 
----------------------+-----------+----------
                Total |    22,409 |    22,482 

. tab year covid_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |         9      3,079 |     3,088 
      2017 |         9      3,079 |     3,088 
      2018 |         9      3,079 |     3,088 
      2019 |         9      3,079 |     3,088 
      2020 |         9      3,079 |     3,088 
      2021 |         9      3,079 |     3,088 
      2022 |         9      3,071 |     3,080 
      2023 |         5        432 |       437 
      2024 |         5        432 |       437 
-----------+----------------------+----------
     Total |        73     22,409 |    22,482 

. 
. ** Organize data
. order year fips state_* county_*

. sort fips year

. isid fips year

. 
. ** Keep only sample with non-missing base population
> s
. tab county_name year if (missing(n1_out_1 ) | n1_out
> _1 == 0 ) & year <= 2022

                      |  Tax year
                      |   (year
                      |   before
                      |   move)
          County name |      2017 |     Total
----------------------+-----------+----------
        Loving County |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 

. drop if (missing(n1_out_1 ) | n1_out_1 == 0 ) & year
>  <= 2022
(1 observation deleted)

. 
. ** Keep only sample with observations in each year
. bysort fips: gen ct = _N

. tab county_name state_name if ct < 7

                      | State name
          County name | Connect.. |     Total
----------------------+-----------+----------
     Fairfield County |         6 |         6 
      Hartford County |         6 |         6 
    Litchfield County |         6 |         6 
        Loving County |         0 |         6 
     Middlesex County |         6 |         6 
     New Haven County |         6 |         6 
    New London County |         6 |         6 
       Tolland County |         6 |         6 
       Windham County |         6 |         6 
----------------------+-----------+----------
                Total |        48 |        54 


                      | State name
          County name |     Texas |     Total
----------------------+-----------+----------
     Fairfield County |         0 |         6 
      Hartford County |         0 |         6 
    Litchfield County |         0 |         6 
        Loving County |         6 |         6 
     Middlesex County |         0 |         6 
     New Haven County |         0 |         6 
    New London County |         0 |         6 
       Tolland County |         0 |         6 
       Windham County |         0 |         6 
----------------------+-----------+----------
                Total |         6 |        54 

. drop if ct < 7
(54 observations deleted)

. drop ct

. 
. ** Generate IRS sample
. gen irs_sample_1 = inrange(year, 2016, 2022)

. gen irs_sample_2 = inrange(year, 2016, 2022) & merge
> _acs_1 != 1

. 
. ** Generate ACS Period Indicators
. gen acs_period_1 = merge_acs_1 != 1 & inrange(year, 
> 2016, 2022)

. gen acs_period_2 = merge_acs_1 != 1

. 
. ** Make sure we have a balanced panel of ACS countie
> s
. gen tmp = merge_acs_1 != 1

. bysort fips: egen ct_tmp = total(tmp)

. replace acs_period_1 = 0 if ct_tmp != 9
(246 real changes made)

. replace acs_period_2 = 0 if ct_tmp != 9
(342 real changes made)

. replace irs_sample_2 = 0 if ct_tmp != 9
(246 real changes made)

. drop tmp ct_tmp

. 
. tab year irs_sample_1

  Tax year |
     (year |
    before |     irs_sample_1
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |         0      3,079 |     3,079 
      2017 |         0      3,079 |     3,079 
      2018 |         0      3,079 |     3,079 
      2019 |         0      3,079 |     3,079 
      2020 |         0      3,079 |     3,079 
      2021 |         0      3,079 |     3,079 
      2022 |         0      3,079 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |       874     21,553 |    22,427 

. tab year irs_sample_2

  Tax year |
     (year |
    before |     irs_sample_2
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |    19,704      2,723 |    22,427 

. tab year acs_period_1

  Tax year |
     (year |
    before |     acs_period_1
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |    19,704      2,723 |    22,427 

. tab year acs_period_2

  Tax year |
     (year |
    before |     acs_period_2
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |        48        389 |       437 
      2024 |        48        389 |       437 
-----------+----------------------+----------
     Total |    18,926      3,501 |    22,427 

. tab state_name acs_period_1

                      | acs_period
                      |     _1
           State name |         0 |     Total
----------------------+-----------+----------
              Alabama |       458 |       479 
               Alaska |       191 |       198 
              Arizona |        92 |       113 
             Arkansas |       510 |       531 
           California |       236 |       474 
             Colorado |       445 |       452 
             Delaware |         6 |        27 
 District of Columbia |         2 |         9 
              Florida |       339 |       535 
              Georgia |     1,017 |     1,157 
               Hawaii |        11 |        25 
                Idaho |       303 |       310 
             Illinois |       656 |       740 
              Indiana |       564 |       676 
                 Iowa |       675 |       703 
               Kansas |       720 |       741 
             Kentucky |       819 |       854 
            Louisiana |       413 |       462 
                Maine |       102 |       116 
             Maryland |       113 |       190 
        Massachusetts |       102 |       116 
             Michigan |       501 |       613 
            Minnesota |       583 |       625 
          Mississippi |       559 |       580 
             Missouri |       784 |       819 
              Montana |       394 |       394 
             Nebraska |       636 |       657 
               Nevada |       109 |       123 
        New Hampshire |        70 |        70 
           New Jersey |        62 |       181 
           New Mexico |       221 |       235 
             New York |       336 |       476 
       North Carolina |       610 |       736 
         North Dakota |       366 |       373 
                 Ohio |       525 |       658 
             Oklahoma |       526 |       547 
               Oregon |       219 |       268 
         Pennsylvania |       369 |       509 
         Rhode Island |        20 |        41 
       South Carolina |       331 |       338 
         South Dakota |       462 |       462 
            Tennessee |       638 |       687 
                Texas |     1,581 |     1,847 
                 Utah |       178 |       213 
              Vermont |       100 |       100 
             Virginia |       531 |       594 
           Washington |       230 |       293 
        West Virginia |       387 |       387 
            Wisconsin |       439 |       530 
              Wyoming |       163 |       163 
----------------------+-----------+----------
                Total |    19,704 |    22,427 


                      | acs_period
                      |     _1
           State name |         1 |     Total
----------------------+-----------+----------
              Alabama |        21 |       479 
               Alaska |         7 |       198 
              Arizona |        21 |       113 
             Arkansas |        21 |       531 
           California |       238 |       474 
             Colorado |         7 |       452 
             Delaware |        21 |        27 
 District of Columbia |         7 |         9 
              Florida |       196 |       535 
              Georgia |       140 |     1,157 
               Hawaii |        14 |        25 
                Idaho |         7 |       310 
             Illinois |        84 |       740 
              Indiana |       112 |       676 
                 Iowa |        28 |       703 
               Kansas |        21 |       741 
             Kentucky |        35 |       854 
            Louisiana |        49 |       462 
                Maine |        14 |       116 
             Maryland |        77 |       190 
        Massachusetts |        14 |       116 
             Michigan |       112 |       613 
            Minnesota |        42 |       625 
          Mississippi |        21 |       580 
             Missouri |        35 |       819 
              Montana |         0 |       394 
             Nebraska |        21 |       657 
               Nevada |        14 |       123 
        New Hampshire |         0 |        70 
           New Jersey |       119 |       181 
           New Mexico |        14 |       235 
             New York |       140 |       476 
       North Carolina |       126 |       736 
         North Dakota |         7 |       373 
                 Ohio |       133 |       658 
             Oklahoma |        21 |       547 
               Oregon |        49 |       268 
         Pennsylvania |       140 |       509 
         Rhode Island |        21 |        41 
       South Carolina |         7 |       338 
         South Dakota |         0 |       462 
            Tennessee |        49 |       687 
                Texas |       266 |     1,847 
                 Utah |        35 |       213 
              Vermont |         0 |       100 
             Virginia |        63 |       594 
           Washington |        63 |       293 
        West Virginia |         0 |       387 
            Wisconsin |        91 |       530 
              Wyoming |         0 |       163 
----------------------+-----------+----------
                Total |     2,723 |    22,427 

. 
. ** Define treated state
. gen multnomah = state_fips == 41 & county_fips == 51

. label var multnomah "Indicator for Multnomah County,
>  Oregon"

. 
. ** Define treatment indicator
. gen Treated = multnomah == 1 & year > 2020

. label var Treated "Treatment indicator for Multnomah
>  County, Oregon"

. 
. ** Define sample 1: All counties
. gen sample_all = 1

. label var sample_all "All counties (excluding AK, CA
> , HI OR, WA)"

. 
. ** Define sample 2: Counties in top 95 percent
. summ percent_urban if year == 2020, de

            Percent of population in urban areas
------------------------------------------------------
> -------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             
>   3,079
25%            0              0       Sum of wgt.     
>   3,079

50%     .3256337                      Mean           .
> 3521437
                        Largest       Std. dev.       
> .332065
75%     .6326353              1
90%      .847923              1       Variance       .
> 1102672
95%     .9372299              1       Skewness       .
> 3661052
99%     .9972304              1       Kurtosis       1
> .763629

. local cutoff = r(p95)

. tab state_name multnomah if percent_urban >= `cutoff
> ' & year == 2020

                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         0 |     Total
----------------------+-----------+----------
               Alaska |         1 |         1 
              Arizona |         1 |         1 
           California |        15 |        15 
             Colorado |         4 |         4 
             Delaware |         1 |         1 
 District of Columbia |         1 |         1 
              Florida |        13 |        13 
              Georgia |         8 |         8 
               Hawaii |         1 |         1 
                Idaho |         1 |         1 
             Illinois |         5 |         5 
              Indiana |         3 |         3 
                 Iowa |         1 |         1 
               Kansas |         2 |         2 
             Kentucky |         2 |         2 
            Louisiana |         3 |         3 
             Maryland |         3 |         3 
        Massachusetts |         5 |         5 
             Michigan |         3 |         3 
            Minnesota |         3 |         3 
             Missouri |         4 |         4 
             Nebraska |         2 |         2 
               Nevada |         3 |         3 
           New Jersey |        10 |        10 
           New Mexico |         2 |         2 
             New York |         9 |         9 
       North Carolina |         4 |         4 
                 Ohio |         6 |         6 
             Oklahoma |         1 |         1 
               Oregon |         1 |         2 
         Pennsylvania |         4 |         4 
         Rhode Island |         2 |         2 
            Tennessee |         2 |         2 
                Texas |        11 |        11 
                 Utah |         4 |         4 
             Virginia |        10 |        10 
           Washington |         1 |         1 
            Wisconsin |         1 |         1 
----------------------+-----------+----------
                Total |       153 |       154 


                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         1 |     Total
----------------------+-----------+----------
               Alaska |         0 |         1 
              Arizona |         0 |         1 
           California |         0 |        15 
             Colorado |         0 |         4 
             Delaware |         0 |         1 
 District of Columbia |         0 |         1 
              Florida |         0 |        13 
              Georgia |         0 |         8 
               Hawaii |         0 |         1 
                Idaho |         0 |         1 
             Illinois |         0 |         5 
              Indiana |         0 |         3 
                 Iowa |         0 |         1 
               Kansas |         0 |         2 
             Kentucky |         0 |         2 
            Louisiana |         0 |         3 
             Maryland |         0 |         3 
        Massachusetts |         0 |         5 
             Michigan |         0 |         3 
            Minnesota |         0 |         3 
             Missouri |         0 |         4 
             Nebraska |         0 |         2 
               Nevada |         0 |         3 
           New Jersey |         0 |        10 
           New Mexico |         0 |         2 
             New York |         0 |         9 
       North Carolina |         0 |         4 
                 Ohio |         0 |         6 
             Oklahoma |         0 |         1 
               Oregon |         1 |         2 
         Pennsylvania |         0 |         4 
         Rhode Island |         0 |         2 
            Tennessee |         0 |         2 
                Texas |         0 |        11 
                 Utah |         0 |         4 
             Virginia |         0 |        10 
           Washington |         0 |         1 
            Wisconsin |         0 |         1 
----------------------+-----------+----------
                Total |         1 |       154 

. gen sample_urban95 = percent_urban >= `cutoff' // Al
> l counties

. label var sample_urban95 "Urban counties (top 5%) (e
> xcluding AK, CA, HI OR, WA)"

. tab sample_urban95 if year == 2020

      Urban |
   counties |
   (top 5%) |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,925       95.00       95.00
          1 |        154        5.00      100.00
------------+-----------------------------------
      Total |      3,079      100.00

. 
. ** Define sample 3: Counties in top 98 percent
. local cutoff = .9864539 //

. tab state_name multnomah if percent_urban >= `cutoff
> ' & year == 2020

                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         0 |     Total
----------------------+-----------+----------
           California |         6 |         6 
             Colorado |         2 |         2 
 District of Columbia |         1 |         1 
              Florida |         4 |         4 
              Georgia |         5 |         5 
             Illinois |         2 |         2 
              Indiana |         1 |         1 
            Louisiana |         1 |         1 
             Maryland |         1 |         1 
        Massachusetts |         1 |         1 
             Michigan |         1 |         1 
            Minnesota |         1 |         1 
             Missouri |         1 |         1 
               Nevada |         1 |         1 
           New Jersey |         6 |         6 
             New York |         7 |         7 
       North Carolina |         1 |         1 
                 Ohio |         1 |         1 
               Oregon |         0 |         1 
         Pennsylvania |         2 |         2 
         Rhode Island |         1 |         1 
                Texas |         3 |         3 
                 Utah |         2 |         2 
             Virginia |         8 |         8 
            Wisconsin |         1 |         1 
----------------------+-----------+----------
                Total |        60 |        61 


                      | Indicator
                      |    for
                      | Multnomah
                      |  County,
                      |   Oregon
           State name |         1 |     Total
----------------------+-----------+----------
           California |         0 |         6 
             Colorado |         0 |         2 
 District of Columbia |         0 |         1 
              Florida |         0 |         4 
              Georgia |         0 |         5 
             Illinois |         0 |         2 
              Indiana |         0 |         1 
            Louisiana |         0 |         1 
             Maryland |         0 |         1 
        Massachusetts |         0 |         1 
             Michigan |         0 |         1 
            Minnesota |         0 |         1 
             Missouri |         0 |         1 
               Nevada |         0 |         1 
           New Jersey |         0 |         6 
             New York |         0 |         7 
       North Carolina |         0 |         1 
                 Ohio |         0 |         1 
               Oregon |         1 |         1 
         Pennsylvania |         0 |         2 
         Rhode Island |         0 |         1 
                Texas |         0 |         3 
                 Utah |         0 |         2 
             Virginia |         0 |         8 
            Wisconsin |         0 |         1 
----------------------+-----------+----------
                Total |         1 |        61 

. gen sample_urban98 = percent_urban >= `cutoff' // Al
> l counties

. label var sample_urban98 "Urban counties (top 1%) (e
> xcluding AK, CA, HI OR, WA)"

. tab sample_urban98 if year == 2020

      Urban |
   counties |
   (top 1%) |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,018       98.02       98.02
          1 |         61        1.98      100.00
------------+-----------------------------------
      Total |      3,079      100.00

. 
. ** Define Sample of States
. drop if state_name == "Alaska"
(198 observations deleted)

. drop if state_name == "Hawaii"
(25 observations deleted)

. drop if state_name == "California"
(474 observations deleted)

. drop if state_name == "Washington"
(293 observations deleted)

. drop if state_name == "Oregon" & multnomah == 0
(259 observations deleted)

. 
. ** Define sample 4: Counties in top 95 + covid
. cluster kmeans cases_cum* deaths_cum* if        ///
>         sample_urban95 == 1 & year == 2020 & covid_m
> erge == 3 , k(5) gen(kmean)
cluster name: _clus_1

. bysort fips: egen kmean_group = mean(kmean)
(20,046 missing values generated)

. 
. ** Pull out kmeans cluster with Multnoma
. gen tmp1 = kmean if sample_urban95 == 1 & year == 20
> 20 & covid_merge == 3 & multnomah == 1
(21,177 missing values generated)

. egen tmp2 = mean(tmp1)

. gen sample_urban95_covid = sample_urban95 == 1 & kme
> an_group == tmp2

. drop tmp1 tmp2

. label var sample_urban95_covid "Urban counties (top 
> 5%) w. Kmean Covid Match  (excluding AK, CA, HI OR, 
> WA)"

. tab sample_urban95_covid if year == 2020

      Urban |
   counties |
(top 5%) w. |
Kmean Covid |
      Match |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,836       97.26       97.26
          1 |         80        2.74      100.00
------------+-----------------------------------
      Total |      2,916      100.00

. 
. ** Show results across clusters
. preserve

. 
. ** Keep required variables
. keep if sample_urban95 == 1 & year == 2020 & covid_m
> erge == 3
(21,048 observations deleted)

. keep kmean cases_cum* deaths_cum* population

. collapse (mean) cases_cum* deaths_cum* [fw = populat
> ion], by(kmean)

. reshape long cases_cum deaths_cum, i(kmean) j(time)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 2
> 0 21 22 23 24 25 26 27 28 29)

Data                               Wide   ->   Long
------------------------------------------------------
> -----------------------
Number of observations                5   ->   145    
>      
Number of variables                  59   ->   4      
>      
j variable (29 values)                    ->   time
xij variables:
  cases_cum1 cases_cum2 ... cases_cum29   ->   cases_c
> um
deaths_cum1 deaths_cum2 ... deaths_cum29  ->   deaths_
> cum
------------------------------------------------------
> -----------------------

. xtset kmean time

Panel variable: kmean (strongly balanced)
 Time variable: time, 1 to 29
         Delta: 1 unit

. xtline cases_cum

. graph export "${results}sdid/fig_kmeans.jpg", as(jpg
> ) name("Graph") quality(100) replace
file C:/Users/ji252/Documents/GitHub/multnomah-county-
> tax/results/sdid/fig_kmeans.jpg written in JPEG form
> at

. clear

. 
. ** Restore
. restore

. 
. ** Define covariates
. local covariates "population per_capita_income"

. 
. ** Standardize covariates
. foreach v of local covariates {
  2.         egen tmp_v = std(`v')
  3.         replace `v' = tmp_v
  4.         drop tmp_v
  5. } // END COVAR LOOP
(21,178 real changes made)
(21,178 real changes made)

. 
. ** Define outcome variables (IRS)
. foreach x in "n1" "n2" "agi" {
  2. 
.         if "`x'" == "n1" local xtxt "returns"
  3.         else if "`x'" == "n2" local xtxt "exempti
> ons"
  4.         else if "`x'" == "agi" local xtxt "AGI"
  5. 
.         ** Loop over migration type
.         foreach y in "net" "in" "out" {
  6. 
.                         if "`y'" == "net" local ytxt
>  "Net domestic migration"
  7.                         else if "`y'" == "in" loc
> al ytxt "Domestic in-migration"
  8.                         else if "`y'" == "out" lo
> cal ytxt "Domestic out-migration"
  9. 
.                         ** Generate
.                         gen `x'_`y'_rate_irs = 100 *
>  (`x'_`y'_3 / (`x'_out_1 + `x'_out_2))
 10. 
.                         ** Label var
.                         label var `x'_`y'_rate_irs  
>     "`ytxt' rate, `xtxt' (%)"
 11. 
.         } // END MIGRATION TYPE LOOP
 12. 
. } // END OUTCOME TYPE LOOP
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)

. 
. ** Define outcome variables (ACS)
. 
. ** Rename for loop
. rename acs*_households_* acs*_n1_*

. rename acs*_persons_* acs*_n2_*

. rename acs*_dollars_* acs*_agi_*

. 
. ** Loop over sample
. ** (18+ = 1, college degree == 2, no college degree 
> == 3)
. forvalues i = 1/2{
  2. 
.         if `i' == 1 local itxt ""
  3.         else if `i' == 2 local itxt " (College)"
  4.         else if `i' == 3 local itxt " (No College
> )"
  5. 
. 
.         ** Define outcome variables (IRS)
.         foreach x in "n1" "n2" "agi" {
  6. 
.                 if "`x'" == "n1" local xtxt "HHs"
  7.                 else if "`x'" == "n2" local xtxt 
> "persons"
  8.                 else if "`x'" == "agi" local xtxt
>  "total income"
  9. 
. 
.                 ** Loop over migration type
.                 foreach y in "net" "in" "out" {
 10. 
.                                 if "`y'" == "net" lo
> cal ytxt "Net domestic migration"
 11.                                 else if "`y'" == 
> "in" local ytxt "Domestic in-migration"
 12.                                 else if "`y'" == 
> "out" local ytxt "Domestic out-migration"
 13. 
.                                 ** Generate
.                                 gen `x'_`y'_rate_acs
> `i' = 100 * (acs`i'_`x'_`y'_3 / (acs`i'_`x'_out_1 + 
> acs`i'_`x'_out_2))
 14. 
.                                 ** Label var
.                                 label var `x'_`y'_ra
> te_acs`i' "`ytxt' rate, `xtxt'`itxt' (%)"
 15. 
.                 } // END MIGRATION TYPE LOOP
 16. 
.         } // END OUTCOME TYPE LOOP
 17. 
. } // END SAMPLE LOOP
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)

. 
. ** Declare panel
. xtset fips year

Panel variable: fips (unbalanced)
 Time variable: year, 2016 to 2024
         Delta: 1 unit

. 
. ** Tag unique fips
. egen unique = tag(fips)

. tab year unique

  Tax year |
     (year |
    before |       tag(fips)
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |         0      2,916 |     2,916 
      2017 |     2,916          0 |     2,916 
      2018 |     2,916          0 |     2,916 
      2019 |     2,916          0 |     2,916 
      2020 |     2,916          0 |     2,916 
      2021 |     2,916          0 |     2,916 
      2022 |     2,916          0 |     2,916 
      2023 |       383          0 |       383 
      2024 |       383          0 |       383 
-----------+----------------------+----------
     Total |    18,262      2,916 |    21,178 

. 
. ** Label var
. label var year "Year (destination)"

. 
. /***************************************************
> ****************************
> SECTION 3: CREATE TABLE-LEVEL SPECIFICATION GRID
> Each row represents one table = 6 SDID specs (3 outc
> omes  2 covariate settings)
> ****************************************************
> ***************************/
. 
. ** Save main analysis data
. save "${data}working/sdid_analysis_data.dta", replac
> e
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/sdid_analysis_data.dta saved

. 
. ** Create table-level specification grid
. preserve

. clear

. 
. ** Table units are defined by:
. ** - data_var (irs_sample_1, irs_sample_2, acs_perio
> d_1, acs_period_2)
. ** - out_type (irs, acs1, acs2) - but tied to data_v
> ar
. ** - samp_var (sample_all, sample_urban95, sample_ur
> ban95_covid)
. ** - exclusion (0, 1)
. ** - migr_type (net, in, out)
. ** Total: 6 data-type combos  3 samples  2 exclusi
> ons  3 migrations = 108 tables
. 
. local table_id = 0

. 
. ** Initialize empty dataset
. set obs 0
Number of observations (_N) was 0, now 0.

. gen table_id = .

. gen data_var = ""

. gen out_type = ""

. gen out_txt = ""

. gen samp_var = ""

. gen exclusion = .

. gen migr_type = ""

. 
. save "${data}working/table_grid.dta", replace
(dataset contains 0 observations)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved

. 
. ** Build table grid
. foreach data in "irs_sample_1" "irs_sample_2" "acs_p
> eriod_1" "acs_period_2" {
  2. 
.         ** Different sets of outcome variable types
.         if "`data'" == "irs_sample_1" | "`data'" == 
> "irs_sample_2" {
  3.                 local out_types "irs"
  4.         }
  5.         else {
  6.                 local out_types "acs1 acs2"
  7.         }
  8. 
.         foreach type of local out_types {
  9. 
.                 ** Labels
.                 if "`data'" == "irs_sample_1" local 
> out_txt "irs_full_16_22"
 10.                 else if "`data'" == "irs_sample_2
> " local out_txt "irs_389_16_22"
 11.                 else if "`data'" == "acs_period_1
> " & "`type'" == "acs1" local out_txt "acs_16_22_all"
 12.                 else if "`data'" == "acs_period_1
> " & "`type'" == "acs2" local out_txt "acs_16_22_col"
 13.                 else if "`data'" == "acs_period_2
> " & "`type'" == "acs1" local out_txt "acs_16_24_all"
 14.                 else if "`data'" == "acs_period_2
> " & "`type'" == "acs2" local out_txt "acs_16_24_col"
 15. 
.                 foreach samp in "sample_all" "sample
> _urban95" "sample_urban95_covid" {
 16.                         forvalues exl = 0/1 {
 17.                                 foreach migr in "
> net" "in" "out" {
 18. 
.                                         local table_
> id = `table_id' + 1
 19. 
.                                         ** Add row t
> o grid
.                                         clear
 20.                                         set obs 1
 21.                                         gen table
> _id = `table_id'
 22.                                         gen data_
> var = "`data'"
 23.                                         gen out_t
> ype = "`type'"
 24.                                         gen out_t
> xt = "`out_txt'"
 25.                                         gen samp_
> var = "`samp'"
 26.                                         gen exclu
> sion = `exl'
 27.                                         gen migr_
> type = "`migr'"
 28. 
.                                         append using
>  "${data}working/table_grid.dta"
 29.                                         save "${d
> ata}working/table_grid.dta", replace
 30. 
.                                 }
 31.                         }
 32.                 }
 33.         }
 34. }
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str10, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable samp_var was str14, now str20 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
(variable migr_type was str2, now str3 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable out_txt was str13, now str14 to
       accommodate using data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved

. 
. ** Load and verify grid
. use "${data}working/table_grid.dta", clear

. dis "Total table units: " _N
Total table units: 108

. sort table_id

. save "${data}working/table_grid.dta", replace
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_grid.dta saved

. 
. restore

. 
. /***************************************************
> ****************************
> SECTION 4: DEFINE PARALLEL PROGRAM FOR TABLE-LEVEL S
> DID ESTIMATION
> Each call runs 6 SDID specs and generates one table
> ****************************************************
> ***************************/
. 
. ** Define program to run all SDID specifications for
>  one table
. capture program drop run_sdid_table

. program define run_sdid_table
  1.         syntax, table_id(integer) data_path(strin
> g) results_path(string) reps(integer)
  2. 
.         ** Load table specification from grid
.         preserve
  3.         use "`data_path'working/table_grid.dta", 
> clear
  4.         keep if table_id == `table_id'
  5. 
.         ** Extract specification parameters
.         local data_var = data_var[1]
  6.         local out_type = out_type[1]
  7.         local out_txt = out_txt[1]
  8.         local samp_var = samp_var[1]
  9.         local exl = exclusion[1]
 10.         local migr = migr_type[1]
 11. 
.         restore
 12. 
.         ** Load main analysis data
.         use "`data_path'working/sdid_analysis_data.d
> ta", clear
 13. 
.         ** Define sample
.         gen sample = `samp_var' == 1 & `data_var' ==
>  1
 14.         if `exl' == 1 replace sample = 0 if year 
> == 2020
 15. 
.         ** Skip if no treated unit in sample
.         qui count if multnomah == 1 & sample == 1
 16.         if r(N) == 0 {
 17.                 dis "Skipping table `table_id': n
> o treated unit in sample"
 18.                 exit
 19.         }
 20. 
.         ** Create output directory
.         capture mkdir "`results_path'sdid/`out_txt'"
 21. 
.         ** Define covariates
.         local covariates "population per_capita_inco
> me"
 22. 
.         ** Clear stored estimates
.         eststo clear
 23. 
.         ** Loop over outcomes (n1, n2, agi) and cova
> riate settings (0, 1)
.         foreach outvar in "n1" "n2" "agi" {
 24. 
.                 ** Full outcome variable name
.                 local outcome "`outvar'_`migr'_rate_
> `out_type'"
 25. 
.                 ** Store label
.                 local label : variable label `outcom
> e'
 26. 
.                 ** Loop over covariate settings
.                 forvalues c = 0/1 {
 27. 
.                         ** Covariates
.                         if `c' == 0 local covars ""
 28.                         else if `c' == 1 local co
> vars "covariates(`covariates', projected)"
 29. 
.                         ** File paths for figures
.                         if `exl' == 0 local path "`r
> esults_path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`
> c'_`samp_var'_"
 30.                         if `exl' == 1 local path 
> "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome
> '_`c'_`samp_var'_excl2020_"
 31. 
.                         ** Run SDID
.                         capture noisily {
 32.                                 eststo sdid_`outv
> ar'_`c': sdid `outcome' fips year Treated      ///
>                                         if sample ==
>  1,                         ///
>                                         vce(placebo)
>                             ///
>                                         `covars'    
>                                     ///
>                                         reps(`reps')
>                             ///
>                                         graph graph_
> export("`path'", .pdf)
 33.                         }
 34. 
.                         if _rc != 0 {
 35.                                 dis "SDID failed 
> for `outcome' with covars=`c'"
 36.                                 continue
 37.                         }
 38. 
.                         ** Store results
.                         local tmp_tau = e(ATT)
 39.                         local tmp_se = e(se)
 40.                         matrix omega = e(omega)
 41. 
.                         ** Pre-treatment mean and co
> unty count
.                         qui summ `outcome' if multno
> mah == 1 & Treated == 0
 42.                         local tmp_premean = r(mea
> n)
 43.                         estadd scalar mean = r(me
> an)
 44. 
.                         qui summ `outcome' if year =
> = 2021 & sample == 1
 45.                         local tmp_ncounties = r(N
> )
 46.                         estadd scalar count = r(N
> )
 47. 
.                         ** Save treatment effect res
> ults
.                         preserve
 48.                         clear
 49.                         set obs 1
 50.                         gen table_id = `table_id'
 51.                         gen sample_data = "`out_t
> xt'"
 52.                         gen sample = "`samp_var'"
 53.                         gen outcome = "`outcome'"
 54.                         gen controls = `c'
 55.                         gen exclusion = `exl'
 56.                         gen tau = `tmp_tau'
 57.                         gen se = `tmp_se'
 58.                         gen pval = 2 * (1 - norma
> l(abs(tau/se)))
 59.                         gen ci_lower = tau - 1.96
>  * se
 60.                         gen ci_upper = tau + 1.96
>  * se
 61.                         gen n_counties = `tmp_nco
> unties'
 62.                         gen pre_mean = `tmp_preme
> an'
 63.                         save "`results_path'sdid/
> temp_results/results_`table_id'_`outvar'_`c'.dta", r
> eplace
 64.                         restore
 65. 
.                         ** Save weights
.                         preserve
 66.                         clear
 67.                         svmat double omega, names
> (col)
 68.                         rename c2 fips
 69.                         rename c1 weight
 70.                         gen table_id = `table_id'
 71.                         gen sample_data = "`out_t
> xt'"
 72.                         gen out = "`outcome'"
 73.                         gen sample = "`samp_var'"
 74.                         gen controls = `c'
 75.                         gen exclusion = `exl'
 76.                         drop if weight == 0
 77.                         drop if missing(fips)
 78.                         save "`results_path'sdid/
> temp_weights/weights_`table_id'_`outvar'_`c'.dta", r
> eplace
 79.                         restore
 80. 
.                         ** Run event study
.                         capture noisily {
 81.                                 sdid_event `outco
> me' fips year Treated  ///
>                                         if sample ==
>  1,                                         ///
>                                         `covars'    
>                                                     
> ///
>                                         vce(placebo)
>                                             ///
>                                         brep(`reps')
>                                             ///
>                                         placebo(all)
 82.                         }
 83. 
.                         if _rc == 0 {
 84.                                 ** Store max year
.                                 qui summ year if mul
> tnomah == 1 & sample == 1
 85.                                 local max_yr = r(
> max)
 86. 
.                                 ** Move results from
>  matrix to data
.                                 qui count if multnom
> ah == 1 & sample == 1
 87.                                 local ct = r(N)
 88.                                 local ct = `ct' +
>  1
 89.                                 mat res = e(H)[2.
> .`ct',1..5]
 90. 
.                                 ** Move to data
.                                 svmat res
 91. 
.                                 ** Generate ID varia
> ble
.                                 gen id = `max_yr' - 
> _n + 1 if !missing(res1)
 92. 
.                                 ** Handle exclusion 
> year labeling
.                                 if `exl' == 1 {
 93.                                         replace i
> d = id - 1 if id <= 2020
 94.                                         expand 2 
> if id == 2019, gen(tag)
 95.                                         replace i
> d = 2020 if tag == 1
 96.                                         replace r
> es1 = . if tag == 1
 97.                                         replace r
> es3 = . if tag == 1
 98.                                         replace r
> es4 = . if tag == 1
 99.                                 }
100.                                 label var id "Yea
> r (destination)"
101. 
.                                 ** Sort
.                                 sort id
102. 
.                                 ** Plot
.                                 twoway  (rcap res3 r
> es4 id, lc(gs10) fc(gs11%50))       ///
>                                                 (sca
> tter res1 id, mc(black)),                           
> ///
>                                         legend(off) 
> ytitle("`label'")                                   
> ///
>                                         yline(0, lc(
> red) lp(-))                                         
>         ///
>                                         xline(2020.5
> , lc(black) lp(solid))                              
> ///
>                                         ylabel(-10(2
> .5)10, format(%9.1f))
103. 
.                                 if `exl' == 0 local 
> evpath "`results_path'sdid/`out_txt'/fig_`out_txt'_`
> outcome'_`c'_`samp_var'_eventstudy.jpg"
104.                                 if `exl' == 1 loc
> al evpath "`results_path'sdid/`out_txt'/fig_`out_txt
> '_`outcome'_`c'_`samp_var'_excl2020_eventstudy.jpg"
105. 
.                                 graph export "`evpat
> h'", as(jpg) name("Graph") quality(100) replace
106. 
.                                 ** Clean up
.                                 drop res1 res2 res3 
> res4 res5 id
107.                                 capture drop tag
108.                         }
109. 
.                 } // END COVAR LOOP
110. 
.         } // END OUTCOME LOOP
111. 
.         ** Generate table for this migration type (a
> ll 6 specs)
.         ** Determine table path
.         if `exl' == 0 local tabpath "`results_path's
> did/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var'.t
> ex"
112.         if `exl' == 1 local tabpath "`results_pat
> h'sdid/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var
> '_excl2020.tex"
113. 
.         ** Check if we have all estimates
.         capture confirm matrix e(b)
114. 
.         ** Generate table based on data type
.         if "`data_var'" == "irs_sample_1" | "`data_v
> ar'" == "irs_sample_2" {
115.                 capture noisily {
116.                         esttab  sdid_n1_0 sdid_n1
> _1     ///
>                                         sdid_n2_0 sd
> id_n2_1     ///
>                                         sdid_agi_0 s
> did_agi_1 ///
>                                 using "`tabpath'",  
>                                                     
>         ///
>                                 starlevel("*" 0.10 "
> **" 0.05 "***" 0.01)                ///
>                                 b(%-9.3f) se(%-9.3f)
>  replace                                    ///
>                                 mgroups("Returns" "E
> xemptions" "AGI",                   ///
>                                         pattern(1 0 
> 1 0 1 0) )                                          
> ///
>                                 mtitle( "No Covariat
> es" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates")                   ///
>                                 stats(count mean,   
>                                                     
>         ///
>                                         fmt(%9.0fc %
> 9.3fc)                                              
>         ///
>                                         labels("Numb
> er of Counties" "Pre-treatment mean"))
117.                 }
118.         }
119.         else {
120.                 capture noisily {
121.                         esttab  sdid_n1_0 sdid_n1
> _1     ///
>                                         sdid_n2_0 sd
> id_n2_1     ///
>                                         sdid_agi_0 s
> did_agi_1 ///
>                                 using "`tabpath'",  
>                                                     
>         ///
>                                 starlevel("*" 0.10 "
> **" 0.05 "***" 0.01)                ///
>                                 b(%-9.3f) se(%-9.3f)
>  replace                                    ///
>                                 mgroups("Households"
>  "Adults" "Household Income",       ///
>                                         pattern(1 0 
> 1 0 1 0) )                                          
> ///
>                                 mtitle( "No Covariat
> es" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates"                    ///
>                                                 "No 
> Covariates" "Covariates")                   ///
>                                 stats(count mean,   
>                                                     
>         ///
>                                         fmt(%9.0fc %
> 9.3fc)                                              
>         ///
>                                         labels("Numb
> er of Counties" "Pre-treatment mean"))
122.                 }
123.         }
124. 
.         dis "Completed table `table_id': `out_txt' /
>  `migr' / `samp_var' / excl=`exl'"
125. 
. end

. 
. /***************************************************
> ****************************
> SECTION 5: CREATE TEMPORARY DIRECTORIES AND RUN PARA
> LLEL ESTIMATION
> ****************************************************
> ***************************/
. 
. ** Create temp directories for results
. capture mkdir "${results}sdid/temp_results"

. capture mkdir "${results}sdid/temp_weights"

. 
. ** Create subfolders for each output type
. foreach out_txt in "irs_full_16_22" "irs_389_16_22" 
> "acs_16_22_all" "acs_16_22_col" "acs_16_24_all" "acs
> _16_24_col" {
  2.         capture mkdir "${results}sdid/`out_txt'"
  3. }

. 
. ** Load table grid
. use "${data}working/table_grid.dta", clear

. local n_tables = _N

. dis "Running `n_tables' table units in parallel (eac
> h with 6 SDID specs)..."
Running 108 table units in parallel (each with 6 SDID 
> specs)...

. 
. ** Save table IDs for parallel processing
. preserve

. keep table_id

. save "${data}working/table_ids.dta", replace
file
    C:/Users/ji252/Documents/GitHub/multnomah-county
    > -tax/data/working/table_ids.dta saved

. restore

. 
. ** Define wrapper program for parallel execution
. capture program drop parallel_sdid_wrapper

. program define parallel_sdid_wrapper
  1.         ** Store all table_ids upfront (run_sdid_
> table will overwrite the dataset)
.         local n_obs = _N
  2.         forvalues i = 1/`n_obs' {
  3.                 local tid_`i' = table_id[`i']
  4.         }
  5. 
.         ** Now loop through and process each table
.         forvalues i = 1/`n_obs' {
  6.                 dis "Worker processing table `tid
> _`i'' (`i' of `n_obs' in this chunk)"
  7.                 run_sdid_table, table_id(`tid_`i'
> ') data_path("${data}") results_path("${results}") r
> eps(100)
  8.         }
  9. end

. 
. ** Load table IDs and run in parallel
. use "${data}working/table_ids.dta", clear

. 
. ** Run parallel estimation
. dis "Starting parallel SDID estimation at $S_TIME...
> "
Starting parallel SDID estimation at 07:15:05...

. dis "Each parallel worker processes one table (6 SDI
> D specifications)"
Each parallel worker processes one table (6 SDID speci
> fications)

. timer clear 1

. timer on 1

. 
. parallel, prog(parallel_sdid_wrapper run_sdid_table)
> : parallel_sdid_wrapper
------------------------------------------------------
> --------------------------
Exporting the following program(s): parallel_sdid_wrap
> per run_sdid_table

parallel_sdid_wrapper:
  1.         local n_obs = _N
  2.         forvalues i = 1/`n_obs' {
  3.                 local tid_`i' = table_id[`i']
  4.         }
  5.         forvalues i = 1/`n_obs' {
  6.                 dis "Worker processing table `tid
> _`i'' (`i' of `n_obs' in this chunk)"
  7.                 run_sdid_table, table_id(`tid_`i'
> ') data_path("${data}") results_path("${results}") r
> eps(100)
  8.         }

run_sdid_table:
  1.         syntax, table_id(integer) data_path(strin
> g) results_path(string) reps(integer)
  2.         preserve
  3.         use "`data_path'working/table_grid.dta", 
> clear
  4.         keep if table_id == `table_id'
  5.         local data_var = data_var[1]
  6.         local out_type = out_type[1]
  7.         local out_txt = out_txt[1]
  8.         local samp_var = samp_var[1]
  9.         local exl = exclusion[1]
 10.         local migr = migr_type[1]
 11.         restore
 12.         use "`data_path'working/sdid_analysis_dat
> a.dta", clear
 13.         gen sample = `samp_var' == 1 & `data_var'
>  == 1
 14.         if `exl' == 1 replace sample = 0 if year 
> == 2020
 15.         qui count if multnomah == 1 & sample == 1
 16.         if r(N) == 0 {
 17.                 dis "Skipping table `table_id': n
> o treated unit in sample"
 18.                 exit
 19.         }
 20.         capture mkdir "`results_path'sdid/`out_tx
> t'"
 21.         local covariates "population per_capita_i
> ncome"
 22.         eststo clear
 23.         foreach outvar in "n1" "n2" "agi" {
 24.                 local outcome "`outvar'_`migr'_ra
> te_`out_type'"
 25.                 local label : variable label `out
> come'
 26.                 forvalues c = 0/1 {
 27.                         if `c' == 0 local covars 
> ""
 28.                         else if `c' == 1 local co
> vars "covariates(`covariates', projected)"
 29.                         if `exl' == 0 local path 
> "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome
> '_`c'_`samp_var'_"
 30.                         if `exl' == 1 local path 
> "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome
> '_`c'_`samp_var'_excl2020_"
 31.                         capture noisily {
 32.                                 eststo sdid_`outv
> ar'_`c': sdid `outcome' fips year Treated if sample 
> == 1, vce(placebo) `covars' reps(`reps') graph graph
> _export("`path'", .pdf)
 33.                         }
 34.                         if _rc != 0 {
 35.                                 dis "SDID failed 
> for `outcome' with covars=`c'"
 36.                                 continue
 37.                         }
 38.                         local tmp_tau = e(ATT)
 39.                         local tmp_se = e(se)
 40.                         matrix omega = e(omega)
 41.                         qui summ `outcome' if mul
> tnomah == 1 & Treated == 0
 42.                         local tmp_premean = r(mea
> n)
 43.                         estadd scalar mean = r(me
> an)
 44.                         qui summ `outcome' if yea
> r == 2021 & sample == 1
 45.                         local tmp_ncounties = r(N
> )
 46.                         estadd scalar count = r(N
> )
 47.                         preserve
 48.                         clear
 49.                         set obs 1
 50.                         gen table_id = `table_id'
 51.                         gen sample_data = "`out_t
> xt'"
 52.                         gen sample = "`samp_var'"
 53.                         gen outcome = "`outcome'"
 54.                         gen controls = `c'
 55.                         gen exclusion = `exl'
 56.                         gen tau = `tmp_tau'
 57.                         gen se = `tmp_se'
 58.                         gen pval = 2 * (1 - norma
> l(abs(tau/se)))
 59.                         gen ci_lower = tau - 1.96
>  * se
 60.                         gen ci_upper = tau + 1.96
>  * se
 61.                         gen n_counties = `tmp_nco
> unties'
 62.                         gen pre_mean = `tmp_preme
> an'
 63.                         save "`results_path'sdid/
> temp_results/results_`table_id'_`outvar'_`c'.dta", r
> eplace
 64.                         restore
 65.                         preserve
 66.                         clear
 67.                         svmat double omega, names
> (col)
 68.                         rename c2 fips
 69.                         rename c1 weight
 70.                         gen table_id = `table_id'
 71.                         gen sample_data = "`out_t
> xt'"
 72.                         gen out = "`outcome'"
 73.                         gen sample = "`samp_var'"
 74.                         gen controls = `c'
 75.                         gen exclusion = `exl'
 76.                         drop if weight == 0
 77.                         drop if missing(fips)
 78.                         save "`results_path'sdid/
> temp_weights/weights_`table_id'_`outvar'_`c'.dta", r
> eplace
 79.                         restore
 80.                         capture noisily {
 81.                                 sdid_event `outco
> me' fips year Treated if sample == 1, `covars' vce(p
> lacebo) brep(`reps') placebo(all)
 82.                         }
 83.                         if _rc == 0 {
 84.                                 qui summ year if 
> multnomah == 1 & sample == 1
 85.                                 local max_yr = r(
> max)
 86.                                 qui count if mult
> nomah == 1 & sample == 1
 87.                                 local ct = r(N)
 88.                                 local ct = `ct' +
>  1
 89.                                 mat res = e(H)[2.
> .`ct',1..5]
 90.                                 svmat res
 91.                                 gen id = `max_yr'
>  - _n + 1 if !missing(res1)
 92.                                 if `exl' == 1 {
 93.                                         replace i
> d = id - 1 if id <= 2020
 94.                                         expand 2 
> if id == 2019, gen(tag)
 95.                                         replace i
> d = 2020 if tag == 1
 96.                                         replace r
> es1 = . if tag == 1
 97.                                         replace r
> es3 = . if tag == 1
 98.                                         replace r
> es4 = . if tag == 1
 99.                                 }
100.                                 label var id "Yea
> r (destination)"
101.                                 sort id
102.                                 twoway (rcap res3
>  res4 id, lc(gs10) fc(gs11%50)) (scatter res1 id, mc
> (black)), legend(off) ytitle("`label'") yline(0, lc(
> red) lp(-)) xline(2020.5, lc(black) lp(solid)) ylabe
> l(-10(2.5)10, format(%9.1f))
103.                                 if `exl' == 0 loc
> al evpath "`results_path'sdid/`out_txt'/fig_`out_txt
> '_`outcome'_`c'_`samp_var'_eventstudy.jpg"
104.                                 if `exl' == 1 loc
> al evpath "`results_path'sdid/`out_txt'/fig_`out_txt
> '_`outcome'_`c'_`samp_var'_excl2020_eventstudy.jpg"
105.                                 graph export "`ev
> path'", as(jpg) name("Graph") quality(100) replace
106.                                 drop res1 res2 re
> s3 res4 res5 id
107.                                 capture drop tag
108.                         }
109.                 }
110.         }
111.         if `exl' == 0 local tabpath "`results_pat
> h'sdid/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var
> '.tex"
112.         if `exl' == 1 local tabpath "`results_pat
> h'sdid/`out_txt'/tab_sdid_`out_txt'_`migr'_`samp_var
> '_excl2020.tex"
113.         capture confirm matrix e(b)
114.         if "`data_var'" == "irs_sample_1" | "`dat
> a_var'" == "irs_sample_2" {
115.                 capture noisily {
116.                         esttab sdid_n1_0 sdid_n1_
> 1 sdid_n2_0 sdid_n2_1 sdid_agi_0 sdid_agi_1 using "`
> tabpath'", starlevel("*" 0.10 "**" 0.05 "***" 0.01) 
> b(%-9.3f) se(%-9.3f) replace mgroups("Returns" "Exem
> ptions" "AGI", pattern(1 0 1 0 1 0) ) mtitle( "No Co
> variates" "Covariates" "No Covariates" "Covariates" 
> "No Covariates" "Covariates") stats(count mean, fmt(
> %9.0fc %9.3fc) labels("Number of Counties" "Pre-trea
> tment mean"))
117.                 }
118.         }
119.         else {
120.                 capture noisily {
121.                         esttab sdid_n1_0 sdid_n1_
> 1 sdid_n2_0 sdid_n2_1 sdid_agi_0 sdid_agi_1 using "`
> tabpath'", starlevel("*" 0.10 "**" 0.05 "***" 0.01) 
> b(%-9.3f) se(%-9.3f) replace mgroups("Households" "A
> dults" "Household Income", pattern(1 0 1 0 1 0) ) mt
> itle( "No Covariates" "Covariates" "No Covariates" "
> Covariates" "No Covariates" "Covariates") stats(coun
> t mean, fmt(%9.0fc %9.3fc) labels("Number of Countie
> s" "Pre-treatment mean"))
122.                 }
123.         }
124.         dis "Completed table `table_id': `out_txt
> ' / `migr' / `samp_var' / excl=`exl'"
------------------------------------------------------
> --------------------------
------------------------------------------------------
Parallel Computing with Stata
Child processes: 6
pll_id         : ta8muy18e7
Running at     : C:\Users\ji252\Documents\GitHub\multn
> omah-county-tax
Randtype       : datetime
Waiting for the child processes to finish...
child process 0003 has exited without error...
child process 0004 has exited without error...
child process 0002 has exited without error...
child process 0006 has exited without error...
child process 0005 has exited without error...
The user pressed -break-. Trying to stop the child pro
> cesses...
                 stata():  3598  Stata returned error
       parallel_finito():     -  function returned err
> or
          parallel_run():     -  function returned err
> or
                 <istmt>:     -  function returned err
> or
r(3598);

end of do-file

r(3598);

. clear

. clear all

. do "C:\Users\ji252\AppData\Local\Temp\STD3414_000008
> .tmp"

. 
. ** Preliminaries 
. capture log close 
