---------------------------------------------------------------
      name:  log_02
       log:  C:/Users/ji252/Documents/GitHub/multnomah-county-t
> ax/code/logs/02_log_sdid_parallel_2026-01-16.log
  log type:  text
 opened on:  17 Jan 2026, 01:48:58

. 
. /************************************************************
> *******************
> SECTION 1: SETUP AND CONFIGURATION
> *************************************************************
> ******************/
. 
. ** Set number of parallel clusters (adjust based on your mach
> ine)
. ** Use fewer than total cores to leave resources for system
. local n_clusters = 6

. 
. ** Parameters
. local reps = 100

. 
. ** Initialize parallel processing
. parallel initialize `n_clusters', force
N Child processes: 6
Stata dir:  C:\Program Files\StataNow19/StataMP-64.exe

. 
. /************************************************************
> *******************
> SECTION 2: DATA PREPARATION
> (Same as original - prepares main analysis dataset)
> *************************************************************
> ******************/
. 
. ** Load data
. use "${data}working/irs_county_gross", replace

. 
. ** Keep required variables
. keep year fips state* county* *_net_3 *_out_1 *_out_2 *_in_3 
> *_out_3

. order year fips state* county*

. 
. ** Merge with ACS Data
. merge 1:1 year fips using "${data}working/acs_county_gross_18
> plus", gen(merge_acs_1)
(variable fips was float, now double to accommodate using
       data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        20,771
        from master                    18,963  (merge_acs_1==1)
        from using                      1,808  (merge_acs_1==2)

    Matched                             3,017  (merge_acs_1==3)
    -----------------------------------------

. 
. ** Keep require variables
. keep year fips state* county* *_net_3 *_out_1 *_out_2 *_in_3 
> *_out_3 merge_acs_*

. 
. ** Label acs samples
. rename persons_* acs1_persons_*

. rename households_* acs1_households_*

. rename dollars_* acs1_dollars_*

. 
. ** Merge with ACS Data
. merge 1:1 year fips using "${data}working/acs_county_gross_co
> llege", gen(merge_acs_2)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        18,963
        from master                    18,963  (merge_acs_2==1)
        from using                          0  (merge_acs_2==2)

    Matched                             4,825  (merge_acs_2==3)
    -----------------------------------------

. 
. ** Keep require variables
. keep year fips state* county* *_net_3 *_out_1 *_out_2 *_in_3 
> *_out_3  merge_acs_*

. 
. ** Label acs samples
. rename persons_* acs2_persons_*

. rename households_* acs2_households_*

. rename dollars_* acs2_dollars_*

. 
. ** Drop "other counties"
. drop if county_fips == 0
(483 observations deleted)

. drop if year == 2015
(430 observations deleted)

. 
. ** Merge with Demographic data
. merge m:1 fips using "${data}working/demographics_2020",     
>    ///
>         gen(demo_merge) keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            27
        from master                        27  (demo_merge==1)
        from using                          0  (demo_merge==2)

    Matched                            22,848  (demo_merge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name demo_merge, m

                     | Matching result from
                     |         merge
          State name | Master on  Matched ( |     Total
---------------------+----------------------+----------
                     |        21          0 |        21 
             Alabama |         0        479 |       479 
              Alaska |         6        198 |       204 
             Arizona |         0        113 |       113 
            Arkansas |         0        531 |       531 
          California |         0        474 |       474 
            Colorado |         0        452 |       452 
         Connecticut |         0         48 |        48 
            Delaware |         0         27 |        27 
District of Columbia |         0          9 |         9 
             Florida |         0        535 |       535 
             Georgia |         0      1,157 |     1,157 
              Hawaii |         0         34 |        34 
               Idaho |         0        310 |       310 
            Illinois |         0        740 |       740 
             Indiana |         0        676 |       676 
                Iowa |         0        703 |       703 
              Kansas |         0        741 |       741 
            Kentucky |         0        854 |       854 
           Louisiana |         0        462 |       462 
               Maine |         0        116 |       116 
            Maryland |         0        190 |       190 
       Massachusetts |         0        116 |       116 
            Michigan |         0        613 |       613 
           Minnesota |         0        625 |       625 
         Mississippi |         0        580 |       580 
            Missouri |         0        819 |       819 
             Montana |         0        394 |       394 
            Nebraska |         0        657 |       657 
              Nevada |         0        123 |       123 
       New Hampshire |         0         70 |        70 
          New Jersey |         0        181 |       181 
          New Mexico |         0        235 |       235 
            New York |         0        476 |       476 
      North Carolina |         0        736 |       736 
        North Dakota |         0        373 |       373 
                Ohio |         0        658 |       658 
            Oklahoma |         0        547 |       547 
              Oregon |         0        268 |       268 
        Pennsylvania |         0        509 |       509 
        Rhode Island |         0         41 |        41 
      South Carolina |         0        338 |       338 
        South Dakota |         0        462 |       462 
           Tennessee |         0        687 |       687 
               Texas |         0      1,854 |     1,854 
                Utah |         0        213 |       213 
             Vermont |         0        100 |       100 
            Virginia |         0        951 |       951 
          Washington |         0        293 |       293 
       West Virginia |         0        387 |       387 
           Wisconsin |         0        530 |       530 
             Wyoming |         0        163 |       163 
---------------------+----------------------+----------
               Total |        27     22,848 |    22,875 

. tab year demo_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |         0      3,140 |     3,140 
      2017 |         0      3,140 |     3,140 
      2018 |         0      3,140 |     3,140 
      2019 |         0      3,140 |     3,140 
      2020 |         2      3,140 |     3,142 
      2021 |         2      3,141 |     3,143 
      2022 |         9      3,133 |     3,142 
      2023 |         7        437 |       444 
      2024 |         7        437 |       444 
-----------+----------------------+----------
     Total |        27     22,848 |    22,875 

. 
. ** Keep if matched
. keep if demo_merge == 3
(27 observations deleted)

. drop demo_merge

. 
. ** Rename
. rename population pop_census

. 
. ** Merge with Demographic data
. merge m:1 year fips using "${data}working/bea_economics",    
>    ///
>         gen(econ_merge) keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           366
        from master                       366  (econ_merge==1)
        from using                          0  (econ_merge==2)

    Matched                            22,482  (econ_merge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name econ_merge, m

                     | Matching result from
                     |         merge
          State name | Master on  Matched ( |     Total
---------------------+----------------------+----------
             Alabama |         0        479 |       479 
              Alaska |         0        198 |       198 
             Arizona |         0        113 |       113 
            Arkansas |         0        531 |       531 
          California |         0        474 |       474 
            Colorado |         0        452 |       452 
         Connecticut |         0         48 |        48 
            Delaware |         0         27 |        27 
District of Columbia |         0          9 |         9 
             Florida |         0        535 |       535 
             Georgia |         0      1,157 |     1,157 
              Hawaii |         9         25 |        34 
               Idaho |         0        310 |       310 
            Illinois |         0        740 |       740 
             Indiana |         0        676 |       676 
                Iowa |         0        703 |       703 
              Kansas |         0        741 |       741 
            Kentucky |         0        854 |       854 
           Louisiana |         0        462 |       462 
               Maine |         0        116 |       116 
            Maryland |         0        190 |       190 
       Massachusetts |         0        116 |       116 
            Michigan |         0        613 |       613 
           Minnesota |         0        625 |       625 
         Mississippi |         0        580 |       580 
            Missouri |         0        819 |       819 
             Montana |         0        394 |       394 
            Nebraska |         0        657 |       657 
              Nevada |         0        123 |       123 
       New Hampshire |         0         70 |        70 
          New Jersey |         0        181 |       181 
          New Mexico |         0        235 |       235 
            New York |         0        476 |       476 
      North Carolina |         0        736 |       736 
        North Dakota |         0        373 |       373 
                Ohio |         0        658 |       658 
            Oklahoma |         0        547 |       547 
              Oregon |         0        268 |       268 
        Pennsylvania |         0        509 |       509 
        Rhode Island |         0         41 |        41 
      South Carolina |         0        338 |       338 
        South Dakota |         0        462 |       462 
           Tennessee |         0        687 |       687 
               Texas |         0      1,854 |     1,854 
                Utah |         0        213 |       213 
             Vermont |         0        100 |       100 
            Virginia |       357        594 |       951 
          Washington |         0        293 |       293 
       West Virginia |         0        387 |       387 
           Wisconsin |         0        530 |       530 
             Wyoming |         0        163 |       163 
---------------------+----------------------+----------
               Total |       366     22,482 |    22,848 

. tab year econ_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |        52      3,088 |     3,140 
      2017 |        52      3,088 |     3,140 
      2018 |        52      3,088 |     3,140 
      2019 |        52      3,088 |     3,140 
      2020 |        52      3,088 |     3,140 
      2021 |        53      3,088 |     3,141 
      2022 |        53      3,080 |     3,133 
      2023 |         0        437 |       437 
      2024 |         0        437 |       437 
-----------+----------------------+----------
     Total |       366     22,482 |    22,848 

. 
. ** Keep if matched
. keep if econ_merge == 3
(366 observations deleted)

. drop econ_merge

. 
. ** Merge with COVID-19 Data
. merge m:1 fips using ${data}working/covid_cleaned_wide.dta,  
>    ///
>         gen(covid_merge) keep(master match )
(variable state_name was str20, now str24 to accommodate
       using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            73
        from master                        73  (covid_merge==1)
        from using                          0  (covid_merge==2)

    Matched                            22,409  (covid_merge==3)
    -----------------------------------------

. 
. ** Show match
. tab state_name covid_merge, m

                      | Matching result from
                      |         merge
           State name | Master on  Matched ( |     Total
----------------------+----------------------+----------
              Alabama |         0        479 |       479 
               Alaska |        28        170 |       198 
              Arizona |         0        113 |       113 
             Arkansas |         0        531 |       531 
           California |         0        474 |       474 
             Colorado |         0        452 |       452 
          Connecticut |         0         48 |        48 
             Delaware |         0         27 |        27 
 District of Columbia |         0          9 |         9 
              Florida |         0        535 |       535 
              Georgia |         0      1,157 |     1,157 
               Hawaii |         0         25 |        25 
                Idaho |         0        310 |       310 
             Illinois |         0        740 |       740 
              Indiana |         0        676 |       676 
                 Iowa |         0        703 |       703 
               Kansas |         0        741 |       741 
             Kentucky |         0        854 |       854 
            Louisiana |         0        462 |       462 
                Maine |         0        116 |       116 
             Maryland |         0        190 |       190 
        Massachusetts |         0        116 |       116 
             Michigan |         0        613 |       613 
            Minnesota |         0        625 |       625 
          Mississippi |         0        580 |       580 
             Missouri |         0        819 |       819 
              Montana |         0        394 |       394 
             Nebraska |         0        657 |       657 
               Nevada |         0        123 |       123 
        New Hampshire |         0         70 |        70 
           New Jersey |         0        181 |       181 
           New Mexico |         0        235 |       235 
             New York |        45        431 |       476 
       North Carolina |         0        736 |       736 
         North Dakota |         0        373 |       373 
                 Ohio |         0        658 |       658 
             Oklahoma |         0        547 |       547 
               Oregon |         0        268 |       268 
         Pennsylvania |         0        509 |       509 
         Rhode Island |         0         41 |        41 
       South Carolina |         0        338 |       338 
         South Dakota |         0        462 |       462 
            Tennessee |         0        687 |       687 
                Texas |         0      1,854 |     1,854 
                 Utah |         0        213 |       213 
              Vermont |         0        100 |       100 
             Virginia |         0        594 |       594 
           Washington |         0        293 |       293 
        West Virginia |         0        387 |       387 
            Wisconsin |         0        530 |       530 
              Wyoming |         0        163 |       163 
----------------------+----------------------+----------
                Total |        73     22,409 |    22,482 

. tab year covid_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |         9      3,079 |     3,088 
      2017 |         9      3,079 |     3,088 
      2018 |         9      3,079 |     3,088 
      2019 |         9      3,079 |     3,088 
      2020 |         9      3,079 |     3,088 
      2021 |         9      3,079 |     3,088 
      2022 |         9      3,071 |     3,080 
      2023 |         5        432 |       437 
      2024 |         5        432 |       437 
-----------+----------------------+----------
     Total |        73     22,409 |    22,482 

. 
. ** Merge with Property Tax Rates (time-varying)
. merge m:1 year fips using "${data}working/property_tax_rates_
> overall", ///
>         gen(proptx_merge) keep(master match) keepusing(prop_r
> ate_mean prop_rate_se)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        18,591
        from master                    18,591  (proptx_merge==1
> )
        from using                          0  (proptx_merge==2
> )

    Matched                             3,891  (proptx_merge==3
> )
    -----------------------------------------

. 
. ** Show match
. tab state_name proptx_merge, m

                      | Matching result from
                      |         merge
           State name | Master on  Matched ( |     Total
----------------------+----------------------+----------
              Alabama |       422         57 |       479 
               Alaska |       189          9 |       198 
              Arizona |        71         42 |       113 
             Arkansas |       498         33 |       531 
           California |       168        306 |       474 
             Colorado |       440         12 |       452 
          Connecticut |         0         48 |        48 
             Delaware |         0         27 |        27 
 District of Columbia |         0          9 |         9 
              Florida |       268        267 |       535 
              Georgia |       971        186 |     1,157 
               Hawaii |         7         18 |        25 
                Idaho |       301          9 |       310 
             Illinois |       593        147 |       740 
              Indiana |       532        144 |       676 
                 Iowa |       664         39 |       703 
               Kansas |       714         27 |       741 
             Kentucky |       803         51 |       854 
            Louisiana |       393         69 |       462 
                Maine |        92         24 |       116 
             Maryland |        85        105 |       190 
        Massachusetts |        77         39 |       116 
             Michigan |       469        144 |       613 
            Minnesota |       553         72 |       625 
          Mississippi |       553         27 |       580 
             Missouri |       756         63 |       819 
              Montana |       391          3 |       394 
             Nebraska |       630         27 |       657 
               Nevada |       105         18 |       123 
        New Hampshire |        70          0 |        70 
           New Jersey |        28        153 |       181 
           New Mexico |       211         24 |       235 
             New York |       287        189 |       476 
       North Carolina |       562        174 |       736 
         North Dakota |       364          9 |       373 
                 Ohio |       469        189 |       658 
             Oklahoma |       517         30 |       547 
               Oregon |       196         72 |       268 
         Pennsylvania |       329        180 |       509 
         Rhode Island |        14         27 |        41 
       South Carolina |       290         48 |       338 
         South Dakota |       462          0 |       462 
            Tennessee |       600         87 |       687 
                Texas |     1,512        342 |     1,854 
                 Utah |       168         45 |       213 
              Vermont |        97          3 |       100 
             Virginia |       504         90 |       594 
           Washington |       209         84 |       293 
        West Virginia |       384          3 |       387 
            Wisconsin |       413        117 |       530 
              Wyoming |       160          3 |       163 
----------------------+----------------------+----------
                Total |    18,591      3,891 |    22,482 

. tab year proptx_merge, m

  Tax year |
     (year | Matching result from
    before |         merge
     move) | Master on  Matched ( |     Total
-----------+----------------------+----------
      2016 |     2,658        430 |     3,088 
      2017 |     2,658        430 |     3,088 
      2018 |     2,658        430 |     3,088 
      2019 |     2,658        430 |     3,088 
      2020 |     2,658        430 |     3,088 
      2021 |     2,658        430 |     3,088 
      2022 |     2,643        437 |     3,080 
      2023 |         0        437 |       437 
      2024 |         0        437 |       437 
-----------+----------------------+----------
     Total |    18,591      3,891 |    22,482 

. 
. ** Rename for clarity
. rename prop_rate_mean prop_tax_rate

. rename prop_rate_se prop_tax_rate_se

. label var prop_tax_rate "Mean property tax rate (% of home va
> lue)"

. label var prop_tax_rate_se "SE of property tax rate"

. 
. ** Organize data
. order year fips state_* county_*

. sort fips year

. isid fips year

. 
. ** Keep only sample with non-missing base populations
. tab county_name year if (missing(n1_out_1 ) | n1_out_1 == 0 )
>  & year <= 2022

                      |  Tax year
                      |   (year
                      |   before
                      |   move)
          County name |      2017 |     Total
----------------------+-----------+----------
        Loving County |         1 |         1 
----------------------+-----------+----------
                Total |         1 |         1 

. drop if (missing(n1_out_1 ) | n1_out_1 == 0 ) & year <= 2022
(1 observation deleted)

. 
. ** Keep only sample with observations in each year
. bysort fips: gen ct = _N

. tab county_name state_name if ct < 7

                      |      State name
          County name | Connect..      Texas |     Total
----------------------+----------------------+----------
     Fairfield County |         6          0 |         6 
      Hartford County |         6          0 |         6 
    Litchfield County |         6          0 |         6 
        Loving County |         0          6 |         6 
     Middlesex County |         6          0 |         6 
     New Haven County |         6          0 |         6 
    New London County |         6          0 |         6 
       Tolland County |         6          0 |         6 
       Windham County |         6          0 |         6 
----------------------+----------------------+----------
                Total |        48          6 |        54 

. drop if ct < 7
(54 observations deleted)

. drop ct

. 
. ** Generate IRS sample
. gen irs_sample_1 = inrange(year, 2016, 2022)

. gen irs_sample_2 = inrange(year, 2016, 2022) & merge_acs_1 !=
>  1

. 
. ** Generate ACS Period Indicators
. gen acs_period_1 = merge_acs_1 != 1 & inrange(year, 2016, 202
> 2)

. gen acs_period_2 = merge_acs_1 != 1

. 
. ** Make sure we have a balanced panel of ACS counties
. gen tmp = merge_acs_1 != 1

. bysort fips: egen ct_tmp = total(tmp)

. replace acs_period_1 = 0 if ct_tmp != 9
(246 real changes made)

. replace acs_period_2 = 0 if ct_tmp != 9
(342 real changes made)

. replace irs_sample_2 = 0 if ct_tmp != 9
(246 real changes made)

. drop tmp ct_tmp

. 
. tab year irs_sample_1

  Tax year |
     (year |
    before |     irs_sample_1
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |         0      3,079 |     3,079 
      2017 |         0      3,079 |     3,079 
      2018 |         0      3,079 |     3,079 
      2019 |         0      3,079 |     3,079 
      2020 |         0      3,079 |     3,079 
      2021 |         0      3,079 |     3,079 
      2022 |         0      3,079 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |       874     21,553 |    22,427 

. tab year irs_sample_2

  Tax year |
     (year |
    before |     irs_sample_2
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |    19,704      2,723 |    22,427 

. tab year acs_period_1

  Tax year |
     (year |
    before |     acs_period_1
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |       437          0 |       437 
      2024 |       437          0 |       437 
-----------+----------------------+----------
     Total |    19,704      2,723 |    22,427 

. tab year acs_period_2

  Tax year |
     (year |
    before |     acs_period_2
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |     2,690        389 |     3,079 
      2017 |     2,690        389 |     3,079 
      2018 |     2,690        389 |     3,079 
      2019 |     2,690        389 |     3,079 
      2020 |     2,690        389 |     3,079 
      2021 |     2,690        389 |     3,079 
      2022 |     2,690        389 |     3,079 
      2023 |        48        389 |       437 
      2024 |        48        389 |       437 
-----------+----------------------+----------
     Total |    18,926      3,501 |    22,427 

. tab state_name acs_period_1

                      |     acs_period_1
           State name |         0          1 |     Total
----------------------+----------------------+----------
              Alabama |       458         21 |       479 
               Alaska |       191          7 |       198 
              Arizona |        92         21 |       113 
             Arkansas |       510         21 |       531 
           California |       236        238 |       474 
             Colorado |       445          7 |       452 
             Delaware |         6         21 |        27 
 District of Columbia |         2          7 |         9 
              Florida |       339        196 |       535 
              Georgia |     1,017        140 |     1,157 
               Hawaii |        11         14 |        25 
                Idaho |       303          7 |       310 
             Illinois |       656         84 |       740 
              Indiana |       564        112 |       676 
                 Iowa |       675         28 |       703 
               Kansas |       720         21 |       741 
             Kentucky |       819         35 |       854 
            Louisiana |       413         49 |       462 
                Maine |       102         14 |       116 
             Maryland |       113         77 |       190 
        Massachusetts |       102         14 |       116 
             Michigan |       501        112 |       613 
            Minnesota |       583         42 |       625 
          Mississippi |       559         21 |       580 
             Missouri |       784         35 |       819 
              Montana |       394          0 |       394 
             Nebraska |       636         21 |       657 
               Nevada |       109         14 |       123 
        New Hampshire |        70          0 |        70 
           New Jersey |        62        119 |       181 
           New Mexico |       221         14 |       235 
             New York |       336        140 |       476 
       North Carolina |       610        126 |       736 
         North Dakota |       366          7 |       373 
                 Ohio |       525        133 |       658 
             Oklahoma |       526         21 |       547 
               Oregon |       219         49 |       268 
         Pennsylvania |       369        140 |       509 
         Rhode Island |        20         21 |        41 
       South Carolina |       331          7 |       338 
         South Dakota |       462          0 |       462 
            Tennessee |       638         49 |       687 
                Texas |     1,581        266 |     1,847 
                 Utah |       178         35 |       213 
              Vermont |       100          0 |       100 
             Virginia |       531         63 |       594 
           Washington |       230         63 |       293 
        West Virginia |       387          0 |       387 
            Wisconsin |       439         91 |       530 
              Wyoming |       163          0 |       163 
----------------------+----------------------+----------
                Total |    19,704      2,723 |    22,427 

. 
. ** Define treated state
. gen multnomah = state_fips == 41 & county_fips == 51

. label var multnomah "Indicator for Multnomah County, Oregon"

. 
. ** Define treatment indicator
. gen Treated = multnomah == 1 & year > 2020

. label var Treated "Treatment indicator for Multnomah County, 
> Oregon"

. 
. ** Define sample 1: All counties
. gen sample_all = 1

. label var sample_all "All counties (excluding AK, CA, HI OR, 
> WA)"

. 
. ** Define sample 2: Counties in top 95 percent
. summ percent_urban if year == 2020, de

            Percent of population in urban areas
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,079
25%            0              0       Sum of wgt.       3,079

50%     .3256337                      Mean           .3521437
                        Largest       Std. dev.       .332065
75%     .6326353              1
90%      .847923              1       Variance       .1102672
95%     .9372299              1       Skewness       .3661052
99%     .9972304              1       Kurtosis       1.763629

. local cutoff = r(p95)

. tab state_name multnomah if percent_urban >= `cutoff' & year 
> == 2020

                      |     Indicator for
                      |   Multnomah County,
                      |        Oregon
           State name |         0          1 |     Total
----------------------+----------------------+----------
               Alaska |         1          0 |         1 
              Arizona |         1          0 |         1 
           California |        15          0 |        15 
             Colorado |         4          0 |         4 
             Delaware |         1          0 |         1 
 District of Columbia |         1          0 |         1 
              Florida |        13          0 |        13 
              Georgia |         8          0 |         8 
               Hawaii |         1          0 |         1 
                Idaho |         1          0 |         1 
             Illinois |         5          0 |         5 
              Indiana |         3          0 |         3 
                 Iowa |         1          0 |         1 
               Kansas |         2          0 |         2 
             Kentucky |         2          0 |         2 
            Louisiana |         3          0 |         3 
             Maryland |         3          0 |         3 
        Massachusetts |         5          0 |         5 
             Michigan |         3          0 |         3 
            Minnesota |         3          0 |         3 
             Missouri |         4          0 |         4 
             Nebraska |         2          0 |         2 
               Nevada |         3          0 |         3 
           New Jersey |        10          0 |        10 
           New Mexico |         2          0 |         2 
             New York |         9          0 |         9 
       North Carolina |         4          0 |         4 
                 Ohio |         6          0 |         6 
             Oklahoma |         1          0 |         1 
               Oregon |         1          1 |         2 
         Pennsylvania |         4          0 |         4 
         Rhode Island |         2          0 |         2 
            Tennessee |         2          0 |         2 
                Texas |        11          0 |        11 
                 Utah |         4          0 |         4 
             Virginia |        10          0 |        10 
           Washington |         1          0 |         1 
            Wisconsin |         1          0 |         1 
----------------------+----------------------+----------
                Total |       153          1 |       154 

. gen sample_urban95 = percent_urban >= `cutoff' // All countie
> s

. label var sample_urban95 "Urban counties (top 5%) (excluding 
> AK, CA, HI OR, WA)"

. tab sample_urban95 if year == 2020

      Urban |
   counties |
   (top 5%) |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,925       95.00       95.00
          1 |        154        5.00      100.00
------------+-----------------------------------
      Total |      3,079      100.00

. 
. ** Define sample 3: Counties in top 98 percent
. local cutoff = .9864539 //

. tab state_name multnomah if percent_urban >= `cutoff' & year 
> == 2020

                      |     Indicator for
                      |   Multnomah County,
                      |        Oregon
           State name |         0          1 |     Total
----------------------+----------------------+----------
           California |         6          0 |         6 
             Colorado |         2          0 |         2 
 District of Columbia |         1          0 |         1 
              Florida |         4          0 |         4 
              Georgia |         5          0 |         5 
             Illinois |         2          0 |         2 
              Indiana |         1          0 |         1 
            Louisiana |         1          0 |         1 
             Maryland |         1          0 |         1 
        Massachusetts |         1          0 |         1 
             Michigan |         1          0 |         1 
            Minnesota |         1          0 |         1 
             Missouri |         1          0 |         1 
               Nevada |         1          0 |         1 
           New Jersey |         6          0 |         6 
             New York |         7          0 |         7 
       North Carolina |         1          0 |         1 
                 Ohio |         1          0 |         1 
               Oregon |         0          1 |         1 
         Pennsylvania |         2          0 |         2 
         Rhode Island |         1          0 |         1 
                Texas |         3          0 |         3 
                 Utah |         2          0 |         2 
             Virginia |         8          0 |         8 
            Wisconsin |         1          0 |         1 
----------------------+----------------------+----------
                Total |        60          1 |        61 

. gen sample_urban98 = percent_urban >= `cutoff' // All countie
> s

. label var sample_urban98 "Urban counties (top 1%) (excluding 
> AK, CA, HI OR, WA)"

. tab sample_urban98 if year == 2020

      Urban |
   counties |
   (top 1%) |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,018       98.02       98.02
          1 |         61        1.98      100.00
------------+-----------------------------------
      Total |      3,079      100.00

. 
. ** Define Sample of States
. drop if state_name == "Alaska"
(198 observations deleted)

. drop if state_name == "Hawaii"
(25 observations deleted)

. drop if state_name == "California"
(474 observations deleted)

. drop if state_name == "Washington"
(293 observations deleted)

. drop if state_name == "Oregon" & multnomah == 0
(259 observations deleted)

. 
. ** Define sample 4: Counties in top 95 + covid
. cluster kmeans cases_cum* deaths_cum* if        ///
>         sample_urban95 == 1 & year == 2020 & covid_merge == 3
>  , k(5) gen(kmean)
cluster name: _clus_1

. bysort fips: egen kmean_group = mean(kmean)
(20,046 missing values generated)

. 
. ** Pull out kmeans cluster with Multnoma
. gen tmp1 = kmean if sample_urban95 == 1 & year == 2020 & covi
> d_merge == 3 & multnomah == 1
(21,177 missing values generated)

. egen tmp2 = mean(tmp1)

. gen sample_urban95_covid = sample_urban95 == 1 & kmean_group 
> == tmp2

. drop tmp1 tmp2

. label var sample_urban95_covid "Urban counties (top 5%) w. Km
> ean Covid Match  (excluding AK, CA, HI OR, WA)"

. tab sample_urban95_covid if year == 2020

      Urban |
   counties |
(top 5%) w. |
Kmean Covid |
      Match |
 (excluding |
 AK, CA, HI |
    OR, WA) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,872       98.49       98.49
          1 |         44        1.51      100.00
------------+-----------------------------------
      Total |      2,916      100.00

. 
. ** Show results across clusters
. preserve

. 
. ** Keep required variables
. keep if sample_urban95 == 1 & year == 2020 & covid_merge == 3
(21,048 observations deleted)

. keep kmean cases_cum* deaths_cum* population

. collapse (mean) cases_cum* deaths_cum* [fw = population], by(
> kmean)

. reshape long cases_cum deaths_cum, i(kmean) j(time)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 2
> 3 24 25 26 27 28 29)

Data                               Wide   ->   Long
---------------------------------------------------------------
> --------------
Number of observations                5   ->   145         
Number of variables                  59   ->   4           
j variable (29 values)                    ->   time
xij variables:
  cases_cum1 cases_cum2 ... cases_cum29   ->   cases_cum
deaths_cum1 deaths_cum2 ... deaths_cum29  ->   deaths_cum
---------------------------------------------------------------
> --------------

. xtset kmean time

Panel variable: kmean (strongly balanced)
 Time variable: time, 1 to 29
         Delta: 1 unit

. xtline cases_cum

. graph export "${results}sdid/fig_kmeans.jpg", as(jpg) name("G
> raph") quality(100) replace
file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/resul
> ts/sdid/fig_kmeans.jpg written in JPEG format

. clear

. 
. ** Restore
. restore

. 
. ** Define covariates
. local covariates "population per_capita_income"

. 
. ** Standardize covariates
. foreach v of local covariates {
  2.         egen tmp_v = std(`v')
  3.         replace `v' = tmp_v
  4.         drop tmp_v
  5. } // END COVAR LOOP
(21,178 real changes made)
(21,178 real changes made)

. 
. ** Define outcome variables (IRS)
. foreach x in "n1" "n2" "agi" {
  2. 
.         if "`x'" == "n1" local xtxt "returns"
  3.         else if "`x'" == "n2" local xtxt "exemptions"
  4.         else if "`x'" == "agi" local xtxt "AGI"
  5. 
.         ** Loop over migration type
.         foreach y in "net" "in" "out" {
  6. 
.                         if "`y'" == "net" local ytxt "Net dom
> estic migration"
  7.                         else if "`y'" == "in" local ytxt "
> Domestic in-migration"
  8.                         else if "`y'" == "out" local ytxt 
> "Domestic out-migration"
  9. 
.                         ** Generate
.                         gen `x'_`y'_rate_irs = 100 * (`x'_`y'
> _3 / (`x'_out_1 + `x'_out_2))
 10. 
.                         ** Label var
.                         label var `x'_`y'_rate_irs      "`ytx
> t' rate, `xtxt' (%)"
 11. 
.         } // END MIGRATION TYPE LOOP
 12. 
. } // END OUTCOME TYPE LOOP
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)

. 
. ** Define outcome variables (ACS)
. 
. ** Rename for loop
. rename acs*_households_* acs*_n1_*

. rename acs*_persons_* acs*_n2_*

. rename acs*_dollars_* acs*_agi_*

. 
. ** Loop over sample
. ** (18+ = 1, college degree == 2, no college degree == 3)
. forvalues i = 1/2{
  2. 
.         if `i' == 1 local itxt ""
  3.         else if `i' == 2 local itxt " (College)"
  4.         else if `i' == 3 local itxt " (No College)"
  5. 
. 
.         ** Define outcome variables (IRS)
.         foreach x in "n1" "n2" "agi" {
  6. 
.                 if "`x'" == "n1" local xtxt "HHs"
  7.                 else if "`x'" == "n2" local xtxt "persons"
  8.                 else if "`x'" == "agi" local xtxt "total i
> ncome"
  9. 
. 
.                 ** Loop over migration type
.                 foreach y in "net" "in" "out" {
 10. 
.                                 if "`y'" == "net" local ytxt 
> "Net domestic migration"
 11.                                 else if "`y'" == "in" loca
> l ytxt "Domestic in-migration"
 12.                                 else if "`y'" == "out" loc
> al ytxt "Domestic out-migration"
 13. 
.                                 ** Generate
.                                 gen `x'_`y'_rate_acs`i' = 100
>  * (acs`i'_`x'_`y'_3 / (acs`i'_`x'_out_1 + acs`i'_`x'_out_2))
 14. 
.                                 ** Label var
.                                 label var `x'_`y'_rate_acs`i'
>  "`ytxt' rate, `xtxt'`itxt' (%)"
 15. 
.                 } // END MIGRATION TYPE LOOP
 16. 
.         } // END OUTCOME TYPE LOOP
 17. 
. } // END SAMPLE LOOP
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)
(17,815 missing values generated)

. 
. ** Declare panel
. xtset fips year

Panel variable: fips (unbalanced)
 Time variable: year, 2016 to 2024
         Delta: 1 unit

. 
. ** Tag unique fips
. egen unique = tag(fips)

. tab year unique

  Tax year |
     (year |
    before |       tag(fips)
     move) |         0          1 |     Total
-----------+----------------------+----------
      2016 |         0      2,916 |     2,916 
      2017 |     2,916          0 |     2,916 
      2018 |     2,916          0 |     2,916 
      2019 |     2,916          0 |     2,916 
      2020 |     2,916          0 |     2,916 
      2021 |     2,916          0 |     2,916 
      2022 |     2,916          0 |     2,916 
      2023 |       383          0 |       383 
      2024 |       383          0 |       383 
-----------+----------------------+----------
     Total |    18,262      2,916 |    21,178 

. 
. ** Label var
. label var year "Year (destination)"

. 
. /************************************************************
> *******************
> SECTION 3: CREATE TABLE-LEVEL SPECIFICATION GRID
> Each row represents one table = 6 SDID specs (3 outcomes × 2 
> covariate settings)
> *************************************************************
> ******************/
. 
. ** Save main analysis data
. save "${data}working/sdid_analysis_data.dta", replace
(file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/sdid_analysis_data.dta not found)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/sdid_analysis_data.dta saved

. 
. ** Create table-level specification grid
. preserve

. clear

. 
. ** Table units are defined by:
. ** - data_var (irs_sample_1, irs_sample_2, acs_period_1, acs_
> period_2)
. ** - out_type (irs, acs1, acs2) - but tied to data_var
. ** - samp_var (sample_all, sample_urban95, sample_urban95_cov
> id)
. ** - exclusion (0, 1)
. ** - migr_type (net, in, out)
. ** Total: 6 data-type combos × 3 samples × 2 exclusions × 3 m
> igrations = 108 tables
. 
. local table_id = 0

. 
. ** Initialize empty dataset
. set obs 0
Number of observations (_N) was 0, now 0.

. gen table_id = .

. gen data_var = ""

. gen out_type = ""

. gen out_txt = ""

. gen samp_var = ""

. gen exclusion = .

. gen migr_type = ""

. 
. save "${data}working/table_grid.dta", replace
(dataset contains 0 observations)
(file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta not found)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved

. 
. ** Build table grid
. foreach data in "irs_sample_1" /*"irs_sample_2" "acs_period_1
> " "acs_period_2" */{
  2. 
.         ** Different sets of outcome variable types
.         if "`data'" == "irs_sample_1" | "`data'" == "irs_samp
> le_2" {
  3.                 local out_types "irs"
  4.         }
  5.         else {
  6.                 local out_types "acs1 acs2"
  7.         }
  8. 
.         foreach type of local out_types {
  9. 
.                 ** Labels
.                 if "`data'" == "irs_sample_1" local out_txt "
> irs_full_16_22"
 10.                 else if "`data'" == "irs_sample_2" local o
> ut_txt "irs_389_16_22"
 11.                 else if "`data'" == "acs_period_1" & "`typ
> e'" == "acs1" local out_txt "acs_16_22_all"
 12.                 else if "`data'" == "acs_period_1" & "`typ
> e'" == "acs2" local out_txt "acs_16_22_col"
 13.                 else if "`data'" == "acs_period_2" & "`typ
> e'" == "acs1" local out_txt "acs_16_24_all"
 14.                 else if "`data'" == "acs_period_2" & "`typ
> e'" == "acs2" local out_txt "acs_16_24_col"
 15. 
.                 foreach samp in "sample_all" "sample_urban95"
>  "sample_urban95_covid" {
 16.                         forvalues exl = 0/1 {
 17.                                 foreach migr in "net" "in"
>  "out" {
 18. 
.                                         local table_id = `tab
> le_id' + 1
 19. 
.                                         ** Add row to grid
.                                         clear
 20.                                         set obs 1
 21.                                         gen table_id = `ta
> ble_id'
 22.                                         gen data_var = "`d
> ata'"
 23.                                         gen out_type = "`t
> ype'"
 24.                                         gen out_txt = "`ou
> t_txt'"
 25.                                         gen samp_var = "`s
> amp'"
 26.                                         gen exclusion = `e
> xl'
 27.                                         gen migr_type = "`
> migr'"
 28. 
.                                         append using "${data}
> working/table_grid.dta"
 29.                                         save "${data}worki
> ng/table_grid.dta", replace
 30. 
.                                 }
 31.                         }
 32.                 }
 33.         }
 34. }
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to accommodate using
       data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to accommodate using
       data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to accommodate using
       data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to accommodate using
       data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to accommodate using
       data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
(variable migr_type was str2, now str3 to accommodate using
       data's values)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved
Number of observations (_N) was 0, now 1.
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved

. 
. ** Load and verify grid
. use "${data}working/table_grid.dta", clear

. dis "Total table units: " _N
Total table units: 18

. sort table_id

. save "${data}working/table_grid.dta", replace
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_grid.dta saved

. 
. restore

. 
. /************************************************************
> *******************
> SECTION 4: DEFINE PARALLEL PROGRAM FOR TABLE-LEVEL SDID ESTIM
> ATION
> Each call runs 6 SDID specs and generates one table
> *************************************************************
> ******************/
. 
. ** Define program to run all SDID specifications for one tabl
> e
. capture program drop run_sdid_table

. program define run_sdid_table
  1.         syntax, table_id(integer) data_path(string) result
> s_path(string) reps(integer)
  2. 
.         ** Load table specification from grid
.         preserve
  3.         use "`data_path'working/table_grid.dta", clear
  4.         keep if table_id == `table_id'
  5. 
.         ** Extract specification parameters
.         local data_var = data_var[1]
  6.         local out_type = out_type[1]
  7.         local out_txt = out_txt[1]
  8.         local samp_var = samp_var[1]
  9.         local exl = exclusion[1]
 10.         local migr = migr_type[1]
 11. 
.         restore
 12. 
.         ** Load main analysis data
.         use "`data_path'working/sdid_analysis_data.dta", clea
> r
 13. 
.         ** Define sample
.         gen sample = `samp_var' == 1 & `data_var' == 1
 14.         if `exl' == 1 replace sample = 0 if year == 2020
 15. 
.         ** Skip if no treated unit in sample
.         qui count if multnomah == 1 & sample == 1
 16.         if r(N) == 0 {
 17.                 dis "Skipping table `table_id': no treated
>  unit in sample"
 18.                 exit
 19.         }
 20. 
.         ** Create output directory
.         capture mkdir "`results_path'sdid/`out_txt'"
 21. 
.         ** Define covariates
.         if "`data_var'" == "irs_sample_1" local covariates "p
> opulation per_capita_income"
 22.         else local covariates "population per_capita_incom
> e prop_tax_rate"
 23. 
.         ** Clear stored estimates
.         eststo clear
 24. 
.         ** Loop over outcomes (n1, n2, agi) and covariate set
> tings (0, 1)
.         foreach outvar in "n1" "n2" "agi" {
 25. 
.                 ** Full outcome variable name
.                 local outcome "`outvar'_`migr'_rate_`out_type
> '"
 26. 
.                 ** Store label
.                 local label : variable label `outcome'
 27. 
.                 ** Loop over covariate settings
.                 forvalues c = 0/1 {
 28. 
.                         ** Covariates for sdid (supports 'pro
> jected' option)
.                         if `c' == 0 local covars ""
 29.                         else if `c' == 1 local covars "cov
> ariates(`covariates', projected)"
 30. 
.                         ** Covariates for sdid_event (doesn't
>  support 'projected' option)
.                         if `c' == 0 local covars_event ""
 31.                         else if `c' == 1 local covars_even
> t "covariates(`covariates')"
 32. 
.                         ** File paths for figures
.                         if `exl' == 0 local path "`results_pa
> th'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp_var'_"
 33.                         if `exl' == 1 local path "`results
> _path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp_var'_e
> xcl2020_"
 34. 
.                         ** Run SDID
.                         capture noisily {
 35.                                 eststo sdid_`outvar'_`c': 
> sdid `outcome' fips year Treated      ///
>                                         if sample == 1,      
>                    ///
>                                         vce(placebo)         
>                    ///
>                                         `covars'             
>                            ///
>                                         reps(`reps')         
>                    ///
>                                         graph graph_export("`
> path'", .pdf)
 36.                         }
 37. 
.                         ** Store results
.                         local tmp_tau = e(ATT)
 38.                         local tmp_se = e(se)
 39.                         matrix omega = e(omega)
 40. 
.                         ** Pre-treatment mean and county coun
> t
.                         qui summ `outcome' if multnomah == 1 
> & Treated == 0
 41.                         local tmp_premean = r(mean)
 42.                         estadd scalar mean = r(mean)
 43. 
.                         qui summ `outcome' if year == 2021 & 
> sample == 1
 44.                         local tmp_ncounties = r(N)
 45.                         estadd scalar count = r(N)
 46. 
.                         ** Save treatment effect results
.                         preserve
 47.                         clear
 48.                         set obs 1
 49.                         gen table_id = `table_id'
 50.                         gen sample_data = "`out_txt'"
 51.                         gen sample = "`samp_var'"
 52.                         gen outcome = "`outcome'"
 53.                         gen controls = `c'
 54.                         gen exclusion = `exl'
 55.                         gen tau = `tmp_tau'
 56.                         gen se = `tmp_se'
 57.                         gen pval = 2 * (1 - normal(abs(tau
> /se)))
 58.                         gen ci_lower = tau - 1.96 * se
 59.                         gen ci_upper = tau + 1.96 * se
 60.                         gen n_counties = `tmp_ncounties'
 61.                         gen pre_mean = `tmp_premean'
 62.                         save "`results_path'sdid/temp_resu
> lts/results_`table_id'_`outvar'_`c'.dta", replace
 63.                         restore
 64. 
.                         ** Save weights
.                         preserve
 65.                         clear
 66.                         svmat double omega, names(col)
 67.                         rename c2 fips
 68.                         rename c1 weight
 69.                         gen table_id = `table_id'
 70.                         gen sample_data = "`out_txt'"
 71.                         gen out = "`outcome'"
 72.                         gen sample = "`samp_var'"
 73.                         gen controls = `c'
 74.                         gen exclusion = `exl'
 75.                         drop if weight == 0
 76.                         drop if missing(fips)
 77.                         save "`results_path'sdid/temp_weig
> hts/weights_`table_id'_`outvar'_`c'.dta", replace
 78.                         restore
 79. 
. 
.                         ** Run event study
.                         capture noisily {
 80.                                 sdid_event `outcome' fips 
> year Treated  ///
>                                         if sample == 1,      
>                                    ///
>                                         `covars_event'       
>                                    ///
>                                         vce(placebo)         
>                                    ///
>                                         brep(`reps')         
>                                    ///
>                                         placebo(all)
 81.                         }
 82. 
.                         local event_rc = _rc
 83. 
.                         if `event_rc' == 0 {
 84. 
.                                 ** Store max year
.                                 qui summ year if multnomah ==
>  1 & sample == 1
 85.                                 local max_yr = r(max)
 86. 
.                                 ** Move results from matrix t
> o data
.                                 qui count if multnomah == 1 &
>  sample == 1
 87.                                 local ct = r(N)
 88.                                 local ct = `ct' + 1
 89. 
.                                 ** Extract matrix
.                                 capture mat res = e(H)[2..`ct
> ',1..5]
 90.                                 if _rc != 0 {
 91.                                         continue
 92.                                 }
 93. 
.                                 ** Preserve data before plott
> ing (expand creates duplicate obs)
.                                 preserve
 94. 
.                                 ** Move to data
.                                 svmat res
 95. 
.                                 ** Generate ID variable
.                                 gen id = `max_yr' - _n + 1 if
>  !missing(res1)
 96. 
.                                 ** Handle exclusion year labe
> ling
.                                 if `exl' == 1 {
 97.                                         replace id = id - 
> 1 if id <= 2020
 98.                                         expand 2 if id == 
> 2019, gen(tag)
 99.                                         replace id = 2020 
> if tag == 1
100.                                         replace res1 = . i
> f tag == 1
101.                                         replace res3 = . i
> f tag == 1
102.                                         replace res4 = . i
> f tag == 1
103.                                 }
104.                                 label var id "Year (destin
> ation)"
105. 
.                                 ** Sort
.                                 sort id
106. 
.                                 ** Plot
.                                 twoway  (rcap res3 res4 id, l
> c(gs10) fc(gs11%50))       ///
>                                                 (scatter res1
>  id, mc(black)),                           ///
>                                         legend(off) ytitle("`
> label'")                                   ///
>                                         yline(0, lc(red) lp(-
> ))                                                 ///
>                                         xline(2020.5, lc(blac
> k) lp(solid))                              ///
>                                         ylabel(-10(2.5)10, fo
> rmat(%9.1f))
107. 
.                                 if `exl' == 1 local evpath "`
> results_path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp
> _var'_excl2020_eventstudy.jpg"
108.                                 else local evpath "`result
> s_path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp_var'_
> eventstudy.jpg"
109. 
.                                 graph export "`evpath'", as(j
> pg) name("Graph") quality(100) replace
110. 
.                                 ** Restore data (removes expa
> nded rows and temp variables)
.                                 restore
111. 
.                         }
112.         
.                         ** Clean up sdid_event internal varia
> bles (prevents "already defined" error on next iteration)
.                         capture drop ever_treated*
113. 
.                 } // END COVAR LOOP
114. 
.         } // END OUTCOME LOOP
115. 
.         ** Generate table for this migration type (all 6 spec
> s)
.         ** Determine table path
.         if `exl' == 0 local tabpath "`results_path'sdid/`out_
> txt'/tab_sdid_`out_txt'_`migr'_`samp_var'.tex"
116.         if `exl' == 1 local tabpath "`results_path'sdid/`o
> ut_txt'/tab_sdid_`out_txt'_`migr'_`samp_var'_excl2020.tex"
117. 
.         ** Check if we have all estimates
.         capture confirm matrix e(b)
118. 
.         ** Generate table based on data type
.         if "`data_var'" == "irs_sample_1" | "`data_var'" == "
> irs_sample_2" {
119.                 capture noisily {
120.                         esttab  sdid_n1_0 sdid_n1_1     //
> /
>                                         sdid_n2_0 sdid_n2_1  
>    ///
>                                         sdid_agi_0 sdid_agi_1
>  ///
>                                 using "`tabpath'",           
>                                                    ///
>                                 starlevel("*" 0.10 "**" 0.05 
> "***" 0.01)                ///
>                                 b(%-9.3f) se(%-9.3f) replace 
>                                    ///
>                                 mgroups("Returns" "Exemptions
> " "AGI",                   ///
>                                         pattern(1 0 1 0 1 0) 
> )                                          ///
>                                 mtitle( "No Covariates" "Cova
> riates"                    ///
>                                                 "No Covariate
> s" "Covariates"                    ///
>                                                 "No Covariate
> s" "Covariates")                   ///
>                                 stats(count mean,            
>                                                    ///
>                                         fmt(%9.0fc %9.3fc)   
>                                                    ///
>                                         labels("Number of Cou
> nties" "Pre-treatment mean"))
121.                 }
122.         }
123.         else {
124.                 capture noisily {
125.                         esttab  sdid_n1_0 sdid_n1_1     //
> /
>                                         sdid_n2_0 sdid_n2_1  
>    ///
>                                         sdid_agi_0 sdid_agi_1
>  ///
>                                 using "`tabpath'",           
>                                                    ///
>                                 starlevel("*" 0.10 "**" 0.05 
> "***" 0.01)                ///
>                                 b(%-9.3f) se(%-9.3f) replace 
>                                    ///
>                                 mgroups("Households" "Adults"
>  "Household Income",       ///
>                                         pattern(1 0 1 0 1 0) 
> )                                          ///
>                                 mtitle( "No Covariates" "Cova
> riates"                    ///
>                                                 "No Covariate
> s" "Covariates"                    ///
>                                                 "No Covariate
> s" "Covariates")                   ///
>                                 stats(count mean,            
>                                                    ///
>                                         fmt(%9.0fc %9.3fc)   
>                                                    ///
>                                         labels("Number of Cou
> nties" "Pre-treatment mean"))
126.                 }
127.         }
128. 
.         dis "Completed table `table_id': `out_txt' / `migr' /
>  `samp_var' / excl=`exl'"
129. 
. end

. 
. /************************************************************
> *******************
> SECTION 5: CREATE TEMPORARY DIRECTORIES AND RUN PARALLEL ESTI
> MATION
> *************************************************************
> ******************/
. 
. ** Create temp directories for results
. capture mkdir "${results}sdid/temp_results"

. capture mkdir "${results}sdid/temp_weights"

. 
. ** Create subfolders for each output type
. foreach out_txt in "irs_full_16_22" "irs_389_16_22" "acs_16_2
> 2_all" "acs_16_22_col" "acs_16_24_all" "acs_16_24_col" {
  2.         capture mkdir "${results}sdid/`out_txt'"
  3. }

. 
. ** Load table grid
. use "${data}working/table_grid.dta", clear

. local n_tables = _N

. dis "Running `n_tables' table units in parallel (each with 6 
> SDID specs)..."
Running 18 table units in parallel (each with 6 SDID specs)...

. 
. ** Save table IDs for parallel processing
. ** IMPORTANT: Shuffle table order to balance workload across 
> workers
. ** Without shuffling, child 1 gets all sample_all specs (heav
> iest computation)
. preserve

. keep table_id

. 
. ** Generate random sort order and shuffle
. gen rand_order = runiform()

. sort rand_order

. drop rand_order

. 
. save "${data}working/table_ids.dta", replace
(file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_ids.dta not found)
file
    C:/Users/ji252/Documents/GitHub/multnomah-county-tax/data
    > /working/table_ids.dta saved

. restore

. 
. ** Define wrapper program for parallel execution
. capture program drop parallel_sdid_wrapper

. program define parallel_sdid_wrapper
  1.         ** Store all table_ids upfront (run_sdid_table wil
> l overwrite the dataset)
.         local n_obs = _N
  2.         forvalues i = 1/`n_obs' {
  3.                 local tid_`i' = table_id[`i']
  4.         }
  5. 
.         ** Now loop through and process each table
.         forvalues i = 1/`n_obs' {
  6.                 dis "Worker processing table `tid_`i'' (`i
> ' of `n_obs' in this chunk)"
  7.                 run_sdid_table, table_id(`tid_`i'') data_p
> ath("${data}") results_path("${results}") reps(100)
  8.         }
  9. end

. 
. ** Load table IDs and run in parallel
. use "${data}working/table_ids.dta", clear

. 
. ** Run parallel estimation
. dis "Starting parallel SDID estimation at $S_TIME..."
Starting parallel SDID estimation at 01:49:00...

. dis "Each parallel worker processes one table (6 SDID specifi
> cations)"
Each parallel worker processes one table (6 SDID specifications
> )

. timer clear 1

. timer on 1

. 
. parallel, prog(parallel_sdid_wrapper run_sdid_table): paralle
> l_sdid_wrapper
---------------------------------------------------------------
> -----------------
Exporting the following program(s): parallel_sdid_wrapper run_s
> did_table

parallel_sdid_wrapper:
  1.         local n_obs = _N
  2.         forvalues i = 1/`n_obs' {
  3.                 local tid_`i' = table_id[`i']
  4.         }
  5.         forvalues i = 1/`n_obs' {
  6.                 dis "Worker processing table `tid_`i'' (`i
> ' of `n_obs' in this chunk)"
  7.                 run_sdid_table, table_id(`tid_`i'') data_p
> ath("${data}") results_path("${results}") reps(100)
  8.         }

run_sdid_table:
  1.         syntax, table_id(integer) data_path(string) result
> s_path(string) reps(integer)
  2.         preserve
  3.         use "`data_path'working/table_grid.dta", clear
  4.         keep if table_id == `table_id'
  5.         local data_var = data_var[1]
  6.         local out_type = out_type[1]
  7.         local out_txt = out_txt[1]
  8.         local samp_var = samp_var[1]
  9.         local exl = exclusion[1]
 10.         local migr = migr_type[1]
 11.         restore
 12.         use "`data_path'working/sdid_analysis_data.dta", c
> lear
 13.         gen sample = `samp_var' == 1 & `data_var' == 1
 14.         if `exl' == 1 replace sample = 0 if year == 2020
 15.         qui count if multnomah == 1 & sample == 1
 16.         if r(N) == 0 {
 17.                 dis "Skipping table `table_id': no treated
>  unit in sample"
 18.                 exit
 19.         }
 20.         capture mkdir "`results_path'sdid/`out_txt'"
 21.         if "`data_var'" == "irs_sample_1" local covariates
>  "population per_capita_income"
 22.         else local covariates "population per_capita_incom
> e prop_tax_rate"
 23.         eststo clear
 24.         foreach outvar in "n1" "n2" "agi" {
 25.                 local outcome "`outvar'_`migr'_rate_`out_t
> ype'"
 26.                 local label : variable label `outcome'
 27.                 forvalues c = 0/1 {
 28.                         if `c' == 0 local covars ""
 29.                         else if `c' == 1 local covars "cov
> ariates(`covariates', projected)"
 30.                         if `c' == 0 local covars_event ""
 31.                         else if `c' == 1 local covars_even
> t "covariates(`covariates')"
 32.                         if `exl' == 0 local path "`results
> _path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp_var'_"
 33.                         if `exl' == 1 local path "`results
> _path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp_var'_e
> xcl2020_"
 34.                         capture noisily {
 35.                                 eststo sdid_`outvar'_`c': 
> sdid `outcome' fips year Treated if sample == 1, vce(placebo)
>  `covars' reps(`reps') graph graph_export("`path'", .pdf)
 36.                         }
 37.                         local tmp_tau = e(ATT)
 38.                         local tmp_se = e(se)
 39.                         matrix omega = e(omega)
 40.                         qui summ `outcome' if multnomah ==
>  1 & Treated == 0
 41.                         local tmp_premean = r(mean)
 42.                         estadd scalar mean = r(mean)
 43.                         qui summ `outcome' if year == 2021
>  & sample == 1
 44.                         local tmp_ncounties = r(N)
 45.                         estadd scalar count = r(N)
 46.                         preserve
 47.                         clear
 48.                         set obs 1
 49.                         gen table_id = `table_id'
 50.                         gen sample_data = "`out_txt'"
 51.                         gen sample = "`samp_var'"
 52.                         gen outcome = "`outcome'"
 53.                         gen controls = `c'
 54.                         gen exclusion = `exl'
 55.                         gen tau = `tmp_tau'
 56.                         gen se = `tmp_se'
 57.                         gen pval = 2 * (1 - normal(abs(tau
> /se)))
 58.                         gen ci_lower = tau - 1.96 * se
 59.                         gen ci_upper = tau + 1.96 * se
 60.                         gen n_counties = `tmp_ncounties'
 61.                         gen pre_mean = `tmp_premean'
 62.                         save "`results_path'sdid/temp_resu
> lts/results_`table_id'_`outvar'_`c'.dta", replace
 63.                         restore
 64.                         preserve
 65.                         clear
 66.                         svmat double omega, names(col)
 67.                         rename c2 fips
 68.                         rename c1 weight
 69.                         gen table_id = `table_id'
 70.                         gen sample_data = "`out_txt'"
 71.                         gen out = "`outcome'"
 72.                         gen sample = "`samp_var'"
 73.                         gen controls = `c'
 74.                         gen exclusion = `exl'
 75.                         drop if weight == 0
 76.                         drop if missing(fips)
 77.                         save "`results_path'sdid/temp_weig
> hts/weights_`table_id'_`outvar'_`c'.dta", replace
 78.                         restore
 79.                         capture noisily {
 80.                                 sdid_event `outcome' fips 
> year Treated if sample == 1, `covars_event' vce(placebo) brep
> (`reps') placebo(all)
 81.                         }
 82.                         local event_rc = _rc
 83.                         if `event_rc' == 0 {
 84.                                 qui summ year if multnomah
>  == 1 & sample == 1
 85.                                 local max_yr = r(max)
 86.                                 qui count if multnomah == 
> 1 & sample == 1
 87.                                 local ct = r(N)
 88.                                 local ct = `ct' + 1
 89.                                 capture mat res = e(H)[2..
> `ct',1..5]
 90.                                 if _rc != 0 {
 91.                                         continue
 92.                                 }
 93.                                 preserve
 94.                                 svmat res
 95.                                 gen id = `max_yr' - _n + 1
>  if !missing(res1)
 96.                                 if `exl' == 1 {
 97.                                         replace id = id - 
> 1 if id <= 2020
 98.                                         expand 2 if id == 
> 2019, gen(tag)
 99.                                         replace id = 2020 
> if tag == 1
100.                                         replace res1 = . i
> f tag == 1
101.                                         replace res3 = . i
> f tag == 1
102.                                         replace res4 = . i
> f tag == 1
103.                                 }
104.                                 label var id "Year (destin
> ation)"
105.                                 sort id
106.                                 twoway (rcap res3 res4 id,
>  lc(gs10) fc(gs11%50)) (scatter res1 id, mc(black)), legend(o
> ff) ytitle("`label'") yline(0, lc(red) lp(-)) xline(2020.5, l
> c(black) lp(solid)) ylabel(-10(2.5)10, format(%9.1f))
107.                                 if `exl' == 1 local evpath
>  "`results_path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`s
> amp_var'_excl2020_eventstudy.jpg"
108.                                 else local evpath "`result
> s_path'sdid/`out_txt'/fig_`out_txt'_`outcome'_`c'_`samp_var'_
> eventstudy.jpg"
109.                                 graph export "`evpath'", a
> s(jpg) name("Graph") quality(100) replace
110.                                 restore
111.                         }
112.                         capture drop ever_treated*
113.                 }
114.         }
115.         if `exl' == 0 local tabpath "`results_path'sdid/`o
> ut_txt'/tab_sdid_`out_txt'_`migr'_`samp_var'.tex"
116.         if `exl' == 1 local tabpath "`results_path'sdid/`o
> ut_txt'/tab_sdid_`out_txt'_`migr'_`samp_var'_excl2020.tex"
117.         capture confirm matrix e(b)
118.         if "`data_var'" == "irs_sample_1" | "`data_var'" =
> = "irs_sample_2" {
119.                 capture noisily {
120.                         esttab sdid_n1_0 sdid_n1_1 sdid_n2
> _0 sdid_n2_1 sdid_agi_0 sdid_agi_1 using "`tabpath'", starlev
> el("*" 0.10 "**" 0.05 "***" 0.01) b(%-9.3f) se(%-9.3f) replac
> e mgroups("Returns" "Exemptions" "AGI", pattern(1 0 1 0 1 0) 
> ) mtitle( "No Covariates" "Covariates" "No Covariates" "Covar
> iates" "No Covariates" "Covariates") stats(count mean, fmt(%9
> .0fc %9.3fc) labels("Number of Counties" "Pre-treatment mean"
> ))
121.                 }
122.         }
123.         else {
124.                 capture noisily {
125.                         esttab sdid_n1_0 sdid_n1_1 sdid_n2
> _0 sdid_n2_1 sdid_agi_0 sdid_agi_1 using "`tabpath'", starlev
> el("*" 0.10 "**" 0.05 "***" 0.01) b(%-9.3f) se(%-9.3f) replac
> e mgroups("Households" "Adults" "Household Income", pattern(1
>  0 1 0 1 0) ) mtitle( "No Covariates" "Covariates" "No Covari
> ates" "Covariates" "No Covariates" "Covariates") stats(count 
> mean, fmt(%9.0fc %9.3fc) labels("Number of Counties" "Pre-tre
> atment mean"))
126.                 }
127.         }
128.         dis "Completed table `table_id': `out_txt' / `migr
> ' / `samp_var' / excl=`exl'"
---------------------------------------------------------------
> -----------------
---------------------------------------------------------------
Parallel Computing with Stata
Child processes: 6
pll_id         : ke737fslb3
Running at     : C:\Users\ji252\Documents\GitHub\multnomah-coun
> ty-tax
Randtype       : datetime
Waiting for the child processes to finish...
child process 0004 has exited without error...
child process 0006 has exited without error...
child process 0005 has exited without error...
child process 0001 has exited without error...
child process 0002 has exited without error...
child process 0003 has exited without error...
--------------------------------------------------------------------------------
Enter -parallel printlog #- to checkout logfiles.
--------------------------------------------------------------------------------

. 
. timer off 1

. timer list 1
   1: 129447.98 /        1 =  129447.9760

. dis "Parallel estimation completed at $S_TIME"
Parallel estimation completed at 13:46:29

. 
. /*******************************************************************************
> SECTION 6: COMBINE PARALLEL RESULTS
> *******************************************************************************/
. 
. dis "Combining results from parallel workers..."
Combining results from parallel workers...

. 
. ** Combine all treatment effect results
. clear

. local files : dir "${results}sdid/temp_results" files "results_*.dta"

. local first = 1

. 
. foreach f of local files {
  2.         if `first' == 1 {
  3.                 use "${results}sdid/temp_results/`f'", clear
  4.                 local first = 0
  5.         }
  6.         else {
  7.                 append using "${results}sdid/temp_results/`f'"
  8.         }
  9. }
(variable sample was str14, now str20 to accommodate using data's values)

. 
. ** Save combined results
. order sample_data sample outcome controls exclusion tau se pval ci_lower ci_upper n_counties pre_mea
> n

. compress
  variable controls was float now byte
  variable exclusion was float now byte
  variable n_counties was float now int
  variable table_id was float now byte
  (1,188 bytes saved)

. save "${results}sdid/sdid_results_v1.dta", replace
(file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_results_v1.dta not
    found)
file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_results_v1.dta saved

. export excel using "${results}sdid/sdid_results_v1.xlsx", firstrow(variables) replace
file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_results_v1.xlsx saved

. 
. ** Combine all weights
. clear

. local files : dir "${results}sdid/temp_weights" files "weights_*.dta"

. local first = 1

. 
. foreach f of local files {
  2.         if `first' == 1 {
  3.                 use "${results}sdid/temp_weights/`f'", clear
  4.                 local first = 0
  5.         }
  6.         else {
  7.                 append using "${results}sdid/temp_weights/`f'"
  8.         }
  9. }
(variable sample was str14, now str20 to accommodate using data's values)

. 
. ** Save combined weights
. order sample_data sample out controls exclusion fips weight

. sort sample_data sample out controls exclusion weight

. compress
  variable controls was float now byte
  variable exclusion was float now byte
  variable table_id was float now byte
  variable fips was double now long
  (961,727 bytes saved)

. save "${results}sdid/sdid_weights_v1.dta", replace
(file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_weights_v1.dta not
    found)
file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_weights_v1.dta saved

. export excel using "${results}sdid/sdid_weights_v1.xlsx", firstrow(variables) replace
file C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_weights_v1.xlsx saved

. 
. ** Clean up temp directories
. shell rmdir "${results}sdid/temp_results" /s /q

. shell rmdir "${results}sdid/temp_weights" /s /q

. 
. dis "Results combined and saved."
Results combined and saved.

. 
. /*******************************************************************************
> SECTION 7: SPECIFICATION CURVE ANALYSIS
> *******************************************************************************/
. /*
> dis "Creating specification curve plots..."
> 
> ** Load treatment effects
> use "${results}sdid/sdid_results.dta", clear
> 
> ** Parse outcome variable names to extract components
> gen outcome_type = ""
> replace outcome_type = "n1" if strpos(outcome, "n1_") > 0
> replace outcome_type = "n2" if strpos(outcome, "n2_") > 0
> replace outcome_type = "agi" if strpos(outcome, "agi_") > 0
> 
> gen migration = ""
> replace migration = "net" if strpos(outcome, "_net_") > 0
> replace migration = "in" if strpos(outcome, "_in_") > 0
> replace migration = "out" if strpos(outcome, "_out_") > 0
> 
> gen data_type = ""
> replace data_type = "IRS" if strpos(outcome, "_irs") > 0
> replace data_type = "ACS All" if strpos(outcome, "_acs1") > 0
> replace data_type = "ACS College" if strpos(outcome, "_acs2") > 0
> 
> ** Create specification indicators for bottom panel
> gen spec_all = sample == "sample_all"
> gen spec_urban95 = sample == "sample_urban95"
> gen spec_covid = sample == "sample_urban95_covid"
> gen spec_covars = controls == 1
> gen spec_excl2020 = exclusion == 1
> gen spec_irs = data_type == "IRS"
> gen spec_acs_all = data_type == "ACS All"
> gen spec_acs_col = data_type == "ACS College"
> 
> ** Loop over outcome types and migration directions
> foreach otype in "n1" "n2" "agi" {
>         foreach migr in "net" "in" "out" {
> 
>                 ** Preserve full data
>                 preserve
> 
>                 ** Keep only relevant specifications
>                 keep if outcome_type == "`otype'" & migration == "`migr'"
> 
>                 ** Check if we have data
>                 qui count
>                 if r(N) == 0 {
>                         restore
>                         continue
>                 }
> 
>                 ** Sort by effect size and create rank
>                 sort tau
>                 gen spec_rank = _n
>                 local n_specs = _N
> 
>                 ** Labels for outcome type
>                 if "`otype'" == "n1" local otype_label "Returns/Households"
>                 else if "`otype'" == "n2" local otype_label "Exemptions/Persons"
>                 else if "`otype'" == "agi" local otype_label "AGI/Income"
> 
>                 ** Labels for migration
>                 if "`migr'" == "net" local migr_label "Net Migration"
>                 else if "`migr'" == "in" local migr_label "In-Migration"
>                 else if "`migr'" == "out" local migr_label "Out-Migration"
> 
>                 ** Create upper panel: Coefficient plot with CIs
>                 twoway  (rcap ci_lower ci_upper spec_rank, lc(gs10) lw(thin))   ///
>                                 (scatter tau spec_rank, mc(navy) ms(O) msize(small)),   ///
>                         legend(off)                                                                 
>                                     ///
>                         ytitle("Treatment Effect (pp)")                                             
>             ///
>                         xtitle("Specification (ranked by effect size)")                         ///
>                         title("`otype_label': `migr_label'", size(medium))                      ///
>                         yline(0, lc(red) lp(dash))                                                  
>                     ///
>                         xlabel(1(5)`n_specs')                                                       
>                     ///
>                         name(coef_`otype'_`migr', replace)
> 
>                 ** Create lower panel: Specification indicators
>                 gen y_all = -1 if spec_all == 1
>                 gen y_urban = -2 if spec_urban95 == 1
>                 gen y_covid = -3 if spec_covid == 1
>                 gen y_covars = -4 if spec_covars == 1
>                 gen y_excl = -5 if spec_excl2020 == 1
>                 gen y_irs = -6 if spec_irs == 1
>                 gen y_acs_all = -7 if spec_acs_all == 1
>                 gen y_acs_col = -8 if spec_acs_col == 1
> 
>                 twoway  (scatter y_all spec_rank, mc(navy) ms(O) msize(vsmall))         ///
>                                 (scatter y_urban spec_rank, mc(navy) ms(O) msize(vsmall))       ///
>                                 (scatter y_covid spec_rank, mc(navy) ms(O) msize(vsmall))       ///
>                                 (scatter y_covars spec_rank, mc(navy) ms(O) msize(vsmall))      ///
>                                 (scatter y_excl spec_rank, mc(navy) ms(O) msize(vsmall))        ///
>                                 (scatter y_irs spec_rank, mc(navy) ms(O) msize(vsmall))         ///
>                                 (scatter y_acs_all spec_rank, mc(navy) ms(O) msize(vsmall))     ///
>                                 (scatter y_acs_col spec_rank, mc(navy) ms(O) msize(vsmall)),///
>                         legend(off)                                                                 
>                                             ///
>                         ytitle("")                                                                  
>                                             ///
>                         xtitle("Specification")                                                     
>                             ///
>                         ylabel( -1 "All Counties"                                                   
>                             ///
>                                         -2 "Urban 95%"                                              
>                                     ///
>                                         -3 "COVID Match"                                            
>                                     ///
>                                         -4 "Covariates"                                             
>                                     ///
>                                         -5 "Excl. 2020"                                             
>                                     ///
>                                         -6 "IRS Data"                                               
>                                     ///
>                                         -7 "ACS All"                                                
>                                     ///
>                                         -8 "ACS College",                                           
>                                     ///
>                                 angle(0) labsize(vsmall))                                           
>                             ///
>                         xlabel(1(5)`n_specs')                                                       
>                             ///
>                         name(spec_`otype'_`migr', replace)
> 
>                 ** Combine panels
>                 graph combine coef_`otype'_`migr' spec_`otype'_`migr',                          ///
>                         cols(1)                                                                     
>                                             ///
>                         xcommon                                                                     
>                                             ///
>                         imargin(zero)                                                               
>                                     ///
>                         title("Specification Curve: `otype_label' - `migr_label'", size(medium))
> 
>                 ** Export combined figure
>                 graph export "${results}sdid/fig_speccurve_`otype'_`migr'.pdf", replace
>                 graph export "${results}sdid/fig_speccurve_`otype'_`migr'.jpg", as(jpg) quality(100)
>  replace
> 
>                 ** Clean up
>                 graph drop coef_`otype'_`migr' spec_`otype'_`migr'
> 
>                 restore
> 
>         } // END MIGRATION LOOP
> } // END OUTCOME TYPE LOOP
> */
. /*******************************************************************************
> SECTION 8: CLEANUP AND FINISH
> *******************************************************************************/
. 
. ** Clean up temporary files
. capture erase "${data}working/sdid_analysis_data.dta"

. capture erase "${data}working/table_grid.dta"

. capture erase "${data}working/table_ids.dta"

. 
. ** Report completion
. dis ""


. dis "=============================================="
==============================================

. dis "PARALLEL SDID ANALYSIS COMPLETE"
PARALLEL SDID ANALYSIS COMPLETE

. dis "=============================================="
==============================================

. dis "Results saved to:"
Results saved to:

. dis "  - ${results}sdid/sdid_results.dta"
  - C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_results.dta

. dis "  - ${results}sdid/sdid_weights.dta"
  - C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/sdid_weights.dta

. dis "  - ${results}sdid/*/tab_sdid_*.tex (tables)"
  - C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/*/tab_sdid_*.tex (tables)

. dis "  - ${results}sdid/fig_speccurve_*.pdf"
  - C:/Users/ji252/Documents/GitHub/multnomah-county-tax/results/sdid/fig_speccurve_*.pdf

. dis "=============================================="
==============================================

. 
. ** Close log
. clear

. log close log_02
      name:  log_02
       log:  C:/Users/ji252/Documents/GitHub/multnomah-county-tax/code/logs/02_log_sdid_parallel_2026-
> 01-16.log
  log type:  text
 closed on:  18 Jan 2026, 13:46:36
------------------------------------------------------------------------------------------------------
